{
  "backend/main.mo": "Defines the main canister actor with order, user, design, and access-control data structures and state, plus helpers for validation and role checks.",
  "feature_evidence.json": "Lists implemented features with related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides high‑level summaries of major frontend files and their functionality.",
  "frontend/index.css": "Tailwind base theme definitions and light/dark mode CSS variables for global styling.",
  "frontend/index.html": "HTML entry point that loads the React application root and main script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and startup behavior.",
  "frontend/public/service-worker.js": "Service worker implementing install, fetch, and activate handlers with mixed cache strategies.",
  "frontend/src/App.tsx": "Main app router and bootstrap logic handling authentication, profile loading, access checks, and overall layout rendering.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks permission, with message and navigation button.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Displays a blocked user message with logout functionality and clears cached queries.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Shows an error screen for profile bootstrap failures with retry and logout options plus technical details.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with handling for login conflicts.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Informs authenticated users without profiles and allows copying the principal ID for admin setup.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first admin user to enter a name and trigger initial profile setup.",
  "frontend/src/components/auth/RoleGate.tsx": "Checks user role and conditionally renders children or an access-denied screen.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Renders a table of design image mappings with basic metadata and creation dates.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Dialog to view a design image with loading, error, and fallback states.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Global error boundary that displays a fallback UI with error details and logout/reset actions.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel showing raw technical error details with copy-to-clipboard support.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert with optional retry and detailed error information.",
  "frontend/src/components/exports/ExportActions.tsx": "Provides a dropdown UI for exporting orders in CSV, PDF, or JPEG formats, including per‑karigar exports with filtering by date.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Adds export controls for a single karigar, allowing daily or total PDF/JPEG exports based on filtered orders.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Offers filtering (all, date, design) and export options for karigar orders, triggering PDF/JPEG generation via a callback.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Displays detailed order information in a dialog with an option to open a design image viewer.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with role‑based navigation, mobile/desktop menus, and status indicators.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Dialog form for creating or editing master design mappings, saving updates via a mutation.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog for uploading and parsing master design files, showing parsed results and importing them into storage.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Table listing master designs with edit and activation toggles for each entry.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Scrollable preview table showing parsed order data and highlighting unmapped design codes.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Warning banner indicating skipped or corrupted orders with an option to clear cached data.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Filter bar allowing users to filter orders by karigar, status, date, type flags, and optionally order number.",
  "frontend/src/components/orders/OrdersTable.tsx": "Comprehensive orders table with optional selection, actions, and sanitized order rendering.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog for entering partial fulfillment quantities for RB orders with validation.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog component allowing users to edit an order’s total supplied quantity with validation and backend update mutation.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Compact status widget showing backend online/offline/checking state with refresh, canister ID display, and copy support.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Status bar reflecting network connectivity and pending offline sync operations with manual sync triggering.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useBackendReachability.ts": "Hook that periodically performs backend health checks, classifies errors, and exposes reachability status and data.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Hook for copying text to the clipboard with simple success/error status handling.",
  "frontend/src/hooks/useCurrentUser.ts": "Hook fetching the caller’s user profile with error classification, retry rules, and actor integration.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Hook deriving the effective app role by combining user profile role and backend admin detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider managing Internet Identity login, stored identities, status, and session handling.",
  "frontend/src/hooks/useOrdersCache.ts": "Hydrates orders from IndexedDB, merges with backend results, sanitizes and persists valid orders, and exposes loading/error/cache utilities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, sanitizing, persisting, and mutating orders and related backend data.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor with identity handling, timeout protection, optional admin initialization, and retry logic.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and custom component styles for the UI.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates a printable HTML-based PDF for karigar orders with totals, layout styling, and iOS-friendly handling.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters and formats orders into CSV files for various export types and triggers file download.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders, resolving karigar and generic names, and returns mapped/unmapped sets.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing internal whitespace for consistent matching.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits orders into fixed-size batches for upload or processing.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate order metrics and per-karigar statistics after sanitizing orders.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Normalizes karigar names by trimming and replacing empty values with 'Unassigned'.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Generates a deterministic PO code from a karigar name using a 3-letter prefix and '01'.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Returns an order’s timestamp by prioritizing uploadDate over createdAt and converting from nanoseconds.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Identifies customer orders by checking if the order type contains 'co'.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts sanitized orders by normalized design code and then by order number.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sorts sanitized orders by formatted karigar name, then design code, then order number.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Provides a type guard for validating PersistentOrder objects and a sanitizer that filters invalid entries.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Extracts embedded images from an XLSX file using JSZip, assigning them to rows in order.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses design–image mappings from an Excel sheet and pairs rows with extracted embedded images.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design entries from a workbook using flexible header matching for design, generic, and karigar fields.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from a workbook with flexible column detection, validation, and customer-order inference.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads the SheetJS library if needed and reads an Excel file into a validated workbook object.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Routes master design file parsing between PDF and Excel, handling extraction and errors.",
  "frontend/src/lib/parsers/orderParser.ts": "Parses order files from PDF or Excel, flattening PDF text and delegating to format-specific parsers with error handling.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads PDF.js dynamically and extracts page text into structured lines for tabular parsing.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses master design entries from PDF-extracted lines by identifying headers and extracting code, generic name, and karigar.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text using table-row mode or fallback section-header mode, producing PersistentOrder objects.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Attempts to parse a single PDF table-row line into a PersistentOrder, validating formats and extracting fields.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for orders, master designs, and upload queue with helpers for caching and queueing.",
  "frontend/src/offline/sync.ts": "Provides a hook to sync queued offline ingestions, uploading batches and updating sync state.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard that loads orders, applies filters per tab, manages bulk actions, and displays drill-down views and dialogs.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Page for uploading, parsing, validating, and saving design image mappings from an Excel file.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Displays master design mappings with search, add, edit, and import functionality.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Provides interfaces to create users, manage approvals, and block or unblock user accounts.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Karigar dashboard for viewing active orders, requesting approval, marking orders delivered, and exporting order lists.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding, background image, and a single LoginButton for authentication.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Provides a form for entering and storing an admin bootstrap token, invalidates actor queries, and redirects after successful initialization.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Handles parsing, mapping, previewing, and batched uploading of order files with progress tracking and error handling.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Displays staff dashboards with tabbed order views, filtering, metrics, image viewing, and activity logs.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Shows unmapped design codes, allows searching and opening a form to create new master design mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, monitors updates, and logs activation events.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped-canister, network, or generic cases and extracts safe error details.",
  "frontend/src/utils/errorPresentation.ts": "Converts raw errors into user-friendly messages using bootstrap error classification and decoding logic.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, store, retrieve, and clear URL and sessionStorage parameters, including support for hash-based routing.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it doesn’t resolve within the specified duration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Defines project state metadata, existing features, pending feature requests, and architectural notes for the Karigar Orders system."
}