{
  "backend/main.mo": "Defines core types, authorization helpers, persistent state maps, and basic user/profile/order logic with health check and access control integration.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides written summaries of key frontend files for reference during build or review.",
  "frontend/index.css": "Tailwind-based global styles defining CSS variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML document bootstrapping the React app via main.tsx.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, theme colors, icons, and display settings.",
  "frontend/public/service-worker.js": "Service worker implementing network-first navigation handling, cache-first asset fetching, and cache versioning.",
  "frontend/src/App.tsx": "Main app routing and bootstrap flow handling identity, safe actor creation, profile loading, admin checks, and error states.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI component showing an access denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Displays a full‑page error screen for failed profile bootstrap with retry, logout, and expandable technical details.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button handling Internet Identity authentication, status display, and error recovery.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Shows a screen for authenticated users without a profile, with principal ID copy support and admin‑contact instructions.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal shown to the first administrator to enter a name and trigger initial profile setup.",
  "frontend/src/components/auth/RoleGate.tsx": "Guards child content based on resolved user role, showing loading or access‑denied states when appropriate.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Top‑level error boundary that catches unhandled errors and shows a recovery UI with reload and logout options.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel showing raw technical error details with clipboard copy functionality.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert supporting retry and expandable technical details, with special messaging for stopped canisters.",
  "frontend/src/components/exports/ExportActions.tsx": "Dropdown actions for exporting orders in various formats, including karigar‑specific PDF/JPEG exports with status toasts.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper that builds role-based navigation and renders mobile/desktop menus with connectivity indicators.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Dialog for creating or editing a master design entry with form fields and save handling.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog to upload, parse, preview, and import master design files, showing errors and import summary.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Table displaying master designs with edit and activate/deactivate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Preview table showing parsed order data, highlighting unmapped designs and missing karigar names.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Filter bar allowing users to filter orders by karigar, date range, CO flag, and status.",
  "frontend/src/components/orders/OrdersTable.tsx": "Displays a table of orders with optional status update controls and formatting helpers.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Shows backend online/offline state with canister ID display, refresh button, and collapsible error details.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Shows online/offline status and pending offline sync queue with manual sync trigger.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically checks backend health, classifies errors, and exposes online/offline status and canister data.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy functionality with temporary success/error status labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile with error classification and controlled retry behavior.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Derives the user’s effective app role by combining profile data with backend admin checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, stored identities, and provides login/clear actions via context.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching orders, master designs, unmapped codes, and for batched order uploads with progress tracking.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor with timeout, optional authenticated setup, and retry rules using react-query.",
  "frontend/src/index.css": "Tailwind base/theme definitions with light and dark color variables and global styles.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates a printable PDF-like HTML document for Karigar orders and triggers the browser print dialog.",
  "frontend/src/lib/exports/ordersExport.ts": "Exports filtered orders to CSV based on type (all, CO, daily, karigar) and triggers file download.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Maps orders to master design entries, preserving meaningful karigar names and collecting unmapped codes.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace for consistent comparisons.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits orders into fixed-size batches for chunked uploading.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Calculates aggregate order metrics including totals and karigar-wise breakdown.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats karigar names, defaulting empty values to 'Unassigned'.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Derives an order's timestamp from uploadDate or createdAt and provides date matching helpers.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Checks whether an order type string represents a customer order.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts orders by normalized design code and then by order number.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design data from an Excel workbook, normalizing headers, validating required columns, and returning design entries.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses order data from an Excel workbook by mapping flexible column names, validating fields, and converting rows into Order objects.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads the XLSX library if needed and reads an uploaded Excel file into a validated SheetJS workbook.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Determines file type and parses master design data from either Excel or PDF using the appropriate parser.",
  "frontend/src/lib/parsers/orderParser.ts": "Selects PDF or Excel parsing for order files and converts them into Order objects with error handling.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Dynamically loads PDF.js and extracts structured text from each PDF page for downstream parsing.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses master design entries from extracted PDF text by locating headers and interpreting each data line.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses PDF-extracted text to build Order objects, supporting both table-row and section-header formats. Detects karigar names and validates rows before creating orders or throwing an error if none found.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single PDF table-row line containing an explicit karigar column, extracting order fields with validation. Returns a populated Order object or null on failure.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers. Renders the main App component.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for offline orders, master designs, ingestion queue, and metadata. Provides CRUD helpers for caching, queueing, and retrieving offline data.",
  "frontend/src/offline/sync.ts": "React hook that processes queued offline ingestions, uploading them in batches and updating sync state. Handles errors, progress, and query invalidation after sync.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing orders filtered by date with metrics, tables, and export actions. Supports karigar-wise grouping, downloads, and persistent date selection.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Displays and manages master design mappings with search, add, import, and edit functionality.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Provides a form to create user profiles, validate inputs, assign roles, and handle creation errors.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Shows karigar-specific order metrics and a table of assigned orders with status updates.",
  "frontend/src/pages/LoginPage.tsx": "UI page showing a login screen with branding and a LoginButton. Displays a styled background and centered auth card.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Allows entering a bootstrap token to initialize the first admin and triggers actor reinitialization.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Handles parsing, mapping, previewing, and batch-uploading order files with progress and error handling.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Displays all orders with filters, metrics, exports, and navigation to upload new orders.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Displays unmapped design codes grouped by code with search and a dialog to add mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker, logs lifecycle events, and periodically checks for updates.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap-related errors, detecting stopped canisters, network issues, and extracting canister IDs.",
  "frontend/src/utils/errorPresentation.ts": "Converts errors into user-friendly messages using bootstrap classification and custom heuristics.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, supporting hash routing.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the operation exceeds a specified duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project state, existing issues, and feature requirements for fixing bootstrap loading behavior."
}