{
  "backend/main.mo": "Defines actor state, types, maps, and helper validation/authorization utilities for orders, users, designs, and activity logging.",
  "feature_evidence.json": "Feature evidence report listing features, impacted files, components, tests, and confidence ratings for recent fixes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of major frontend files across the app.",
  "frontend/index.css": "Tailwind CSS base with light/dark design tokens and global styling variables.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, start URL, and icons.",
  "frontend/public/service-worker.js": "Service worker handling caching, network strategies, and versioned cache cleanup.",
  "frontend/src/App.tsx": "Main React router and bootstrap flow handling identity, role checks, error screens, and dashboard routing.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user attempts to access unauthorized pages with a redirect button.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Displays a blocked-user message and allows the user to log out and clear cached queries.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Shows an error screen for profile loading failures with retry and logout actions and optional error details.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with handling for existing sessions and loading state.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Informs authenticated users without a profile and lets them copy their principal ID and refresh the page.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first-time admin users to enter a name and trigger initial profile setup.",
  "frontend/src/components/auth/RoleGate.tsx": "Restricts access to children based on effective app role, showing loading or access denied when appropriate.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Renders a table of design image mappings with design code, name, image status, and creation date.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Dialog that loads and displays a design image with loading, error, and not-found states.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Error boundary that shows a friendly error screen with details and allows page reload or logout.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel showing technical error details with a copy-to-clipboard action.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert with optional technical details and retry button, handling stopped-canister messages.",
  "frontend/src/components/exports/ExportActions.tsx": "Provides export dropdown for CSV and per-karigar PDF/JPEG exports based on filtered orders and date.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Exports a single karigar's daily or total orders as PDF or JPEG with scoped options.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Offers UI controls to filter orders by date or design and trigger PDF/JPEG exports.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Displays detailed karigar order info in a dialog with option to view design image.",
  "frontend/src/components/layout/AppShell.tsx": "Defines main app layout with role-based navigation, header, and mobile/desktop menus.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Form dialog for creating or editing master design mappings and saving them to backend.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog for uploading and parsing master design files, showing parse results and importing new or updated designs.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Displays a table of master designs with edit and activate/deactivate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Scrollable table previewing ingested orders, highlighting unmapped designs and PDF-sourced karigars.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Warning banner showing skipped invalid orders and providing a button to clear cached data.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Filter bar for orders allowing search, date, karigar, status, and CO-only filtering.",
  "frontend/src/components/orders/OrdersTable.tsx": "Full orders table with selection, actions, status display, and sanitized order handling.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog for entering partial quantities for RB orders with validation before confirmation.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog for editing an order’s total supplied quantity with validation and mutation submission.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Shows backend reachability status with refresh, canister ID display, and error details.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Displays online/offline status and pending offline sync queue with manual sync control.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs a backend health check and classifies errors to report online/offline status.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy functionality with success/error status tracking.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile via actor with error classification and conditional retry behavior.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Computes the effective app role by combining user profile data with backend admin checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/useOrdersCache.ts": "Hydrates orders from IndexedDB, merges with backend orders, sanitizes cached data, and exposes loading, error, and cache-clearing helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching, sanitizing, and persisting orders and related data, plus utilities for batched uploads.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor with timeout, optional authenticated initialization, and safe retry behavior.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates printable HTML/PDF exports of karigar orders with metadata and summaries, supporting iOS fallback.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters orders by export type and generates downloadable CSV files with formatted fields.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders, resolving generic and karigar names and reporting unmapped designs.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace for consistent matching.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits orders into equally sized batches and validates batch size.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate and per-karigar order metrics after sanitization.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Normalizes karigar names for display, returning 'Unassigned' when empty.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Generates a deterministic karigar PO code from a name using the first three letters and appending 01, defaulting to UNA01 for empty or unassigned names.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Returns a Date for an order using uploadDate if present, otherwise createdAt, converting nanoseconds to milliseconds.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Checks if an order type string contains 'co' to classify customer orders.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sanitizes and sorts orders by normalized designCode and then by orderNo.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sanitizes and sorts orders by formatted karigar name, then normalized designCode, then orderNo.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Validates PersistentOrder objects and filters invalid ones, returning valid entries and a skipped count.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses an Excel file to extract design codes, generic names, and image URLs with validation for required fields.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design mappings from a workbook using flexible header matching and outputs designCode-to-entry tuples.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from an Excel sheet with flexible column detection, numeric validation, and customer‑order detection.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads SheetJS if needed and reads an Excel file into a workbook with detailed error handling.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Routes master design file parsing to PDF or Excel handlers and wraps both with user‑friendly error handling.",
  "frontend/src/lib/parsers/orderParser.ts": "Parses order files by detecting PDF or Excel format and delegating to the appropriate parser with error handling.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads PDF.js from CDN and extracts per-page text grouped into lines using positional data.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses flattened PDF text lines into master design entries by detecting a header and extracting design, generic, and karigar fields.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses PDF order lines, first trying table-row format with karigar column, then falling back to section-header mode.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single table-style order line with explicit karigar, validating formats and returning a full order object.",
  "frontend/src/main.tsx": "Bootstraps the React app with InternetIdentity and React Query providers.",
  "frontend/src/offline/db.ts": "Provides IndexedDB storage for orders, master designs, a sync queue, and related CRUD helpers.",
  "frontend/src/offline/sync.ts": "Implements offline sync logic to upload queued orders, track progress, and update state and queries.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard that loads orders, applies tab-specific filters, manages cache, and provides dialogs for editing and exporting order data.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Page for uploading, parsing, validating, and saving design image mappings from Excel files.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Interface for listing, searching, adding, editing, and importing master design mappings.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin UI for creating users, managing approvals, and blocking or unblocking user accounts.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Karigar-facing dashboard showing active orders with approval gating, bulk updates, viewing, and export options.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page UI with branding and an Internet Identity login button.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "One-time setup page for initializing the first admin using a bootstrap token.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Handles uploading, parsing, mapping, previewing, and batch‑uploading orders with progress and error handling.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Displays staff dashboards with tabs, filtering, metrics, order tables, and dialogs for fulfillment and edits.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Shows unmapped design codes with search, grouping, and a dialog to create new master design mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates, and logs lifecycle events.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors, detecting stopped canister and network issues, and extracts safe diagnostic details.",
  "frontend/src/utils/errorPresentation.ts": "Converts errors into user‑friendly messages using bootstrap classification and basic message decoding.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL params (including hash routing) and storing, retrieving, and clearing values in sessionStorage.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it doesn't resolve within the given duration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, known issues, and existing feature requirements for the KarigarFlow project."
}