{
  "backend/main.mo": "Main Motoko actor implementing a jewellery order management system with persistent storage for orders, master designs, karigars, user profiles, activity logs, design images, and access control using mixins for authorization, blob storage, and user approval.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing the authentication loop that prevents dashboard access after Internet Identity login, and fixing UI visibility issues with black text on beige backgrounds making content unreadable.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React files describing authentication flow fixes, query hooks, role-based access control, UI components with light theme styling, and dashboard pages for admin/staff/karigar roles.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for backgrounds, foregrounds, borders, and component-specific colors.",
  "frontend/index.html": "HTML entry point for KarigarFlow PWA with mobile-optimized viewport settings, web app manifest link, and theme color configuration.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining KarigarFlow as a standalone jewellery order management app with icons, theme colors, and display settings.",
  "frontend/public/service-worker.js": "Service worker (v54) implementing cache-first strategy for static assets, network-first for navigation/API requests, with install/activate lifecycle handlers and cache cleanup.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, sequential authentication checks (identity → actor → profile → role), protected route wrapper with loading states, and role-based navigation to prevent login loops.",
  "frontend/src/components/admin/KarigarSummaryCards.tsx": "Displays a grid of cards summarizing orders by karigar (craftsperson), showing order count and total quantity for each, with filtering and selection capabilities.",
  "frontend/src/components/admin/MetricsChart.tsx": "Renders four metric cards displaying total orders, total quantity, unique karigars, and unique designs with icons and color-coded styling.",
  "frontend/src/components/admin/TotalQtyBreakdownDialog.tsx": "Modal dialog that displays a breakdown of total quantity across different categories (delivered, hallmark, orders, customer orders, karigars) with a grand total.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen error page shown when a user lacks permission to access a page, with a button to return to the dashboard.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Full-screen page informing users their account has been blocked by an administrator, with a logout button and contact instructions.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen displayed when the application fails to load, showing error details with retry and logout options.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that handles Internet Identity login/logout, clearing query cache and PWA caches on logout.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Screen shown to authenticated users without a profile, displaying their Principal ID with copy functionality and instructions to contact an administrator.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for the first admin user to enter their name during initial application setup, non-dismissible until completed.",
  "frontend/src/components/auth/RoleGate.tsx": "Authorization component that checks user roles and either renders children for authorized users or shows access denied/loading screens.",
  "frontend/src/components/barcode/BarcodeOrdersList.tsx": "Displays a searchable table of orders with visual indicators for highlighted and scanned orders, including design code, order number, karigar, status, and quantity columns.",
  "frontend/src/components/barcode/BatchOrdersTable.tsx": "Renders a table of orders in a batch with order details and a remove button for each row, used for batch hallmark processing.",
  "frontend/src/components/barcode/BatchScannerView.tsx": "Implements batch barcode scanning mode where multiple orders can be scanned and accumulated before marking them all as 'Given for Hallmark' in a single operation.",
  "frontend/src/components/barcode/FastScannerView.tsx": "Implements fast barcode scanning mode where each scanned order is immediately highlighted and can be individually marked as 'Given for Hallmark' with instant feedback.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Displays a table of design image mappings showing design code, generic name, image availability badge, and creation date for each mapping.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Modal dialog that fetches and displays a design image for a given design code, with loading, error, and empty states.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches application errors and displays a friendly error UI with options to reload the page or logout and clear session/caches.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Reusable collapsible panel that displays technical error details with a copy-to-clipboard button for debugging purposes.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Displays an inline error alert with optional retry button, showing either a stopped-canister message or the provided error message, and includes an expandable error details panel.",
  "frontend/src/components/exports/ExportActions.tsx": "Provides a dropdown menu for exporting orders in various formats (CSV for all/CO/daily orders, PDF/JPEG for individual karigars), with filtering by selected date and karigar name.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Exports karigar orders in PDF or JPEG format with options to export either daily orders (filtered by selected date) or total orders (all time).",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Provides a card-based UI for filtering orders by date or design code and exporting them in PDF or JPEG format, displaying filtered order count and export buttons.",
  "frontend/src/components/hallmark/HallmarkOrdersGroupedByDate.tsx": "Groups hallmark orders by date in collapsible cards, displaying order count and total quantity per date, with nested order tables for selection.",
  "frontend/src/components/hallmark/HallmarkOrdersTable.tsx": "Renders a table of hallmark orders with checkboxes for selection, displaying order details like order number, design code, karigar, quantity, weight, size, and timestamp.",
  "frontend/src/components/karigar/AddKarigarDialog.tsx": "Dialog for adding a new karigar with duplicate detection using normalized name comparison (case-insensitive, whitespace-normalized), showing success/error toasts and optional callback on success.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Dialog component that displays detailed order information for karigars, including design code, generic name, weight, size, quantity, status, remarks, and date, with a button to view the associated design image.",
  "frontend/src/components/karigar/TotalKarigarListDialog.tsx": "Dialog component that displays a searchable, scrollable list of all karigars with loading, error, and empty states, allowing selection of a karigar via callback.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout shell that provides role-based navigation (Admin, Staff, Karigar), responsive mobile/desktop menus, header with branding, connectivity status, and user authentication controls.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Dialog form component for creating or editing master design entries with fields for design code, generic name, karigar selection, and active status flag.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog component that handles bulk import of master designs from PDF or Excel files, parsing the file, previewing changes (created/updated counts), and saving to backend with error handling.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Table component displaying master designs with columns for design code, generic name, karigar name, and status, providing edit and toggle active/inactive actions for each entry.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Displays a preview table of orders to be ingested, showing order details with status indicators for mapped/unmapped design codes and highlighting PDF-derived karigar assignments.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Shows an alert banner when invalid orders are detected in local cache, with a button to clear cache and reload data.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Provides a comprehensive filter bar for orders with search, date range, karigar selection, status filtering, and CO/RB-only checkboxes with clear filters functionality.",
  "frontend/src/components/orders/OrdersTable.tsx": "Renders the main orders table with selectable rows, status-based coloring, and a design image viewer dialog triggered by action buttons.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog for specifying partial quantities when fulfilling RB orders, with validation to ensure quantities don't exceed original order amounts.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog for editing the total supplied quantity of an RB order with validation and mutation handling.",
  "frontend/src/components/reconciliation/ReconciliationFileUpload.tsx": "File upload component for Excel files used in reconciliation, showing upload state, file info, and parsing progress.",
  "frontend/src/components/reconciliation/ReconciliationReport.tsx": "Displays a collapsible reconciliation report with three sections (matched, missing, unmapped orders) showing order details in tables with status badges and icons.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Compact header component showing backend connectivity status (online/offline/checking) with collapsible canister ID display and refresh functionality.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Status bar that monitors online/offline state and displays pending sync queue count with manual sync trigger button.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token.",
  "frontend/src/hooks/useBackendReachability.ts": "Polls backend health check every 30 seconds to determine online/offline status, classifying errors for stopped-canister detection and exposing health data including canister ID.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy functionality with status tracking (idle/success/error) and user-friendly button labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the authenticated user's profile from the backend with retry logic that skips auth and timeout errors.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Derives the effective app role by combining user profile role with backend admin check, ensuring admins are always treated as Admin regardless of profile state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOrdersCache.ts": "Hook that hydrates orders from IndexedDB on mount, combines cached and backend data, validates and sanitizes cached orders, and provides loading/error states with cache management functions.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend data fetching and mutations including orders, karigars, master designs, unmapped codes, user profiles, activity logs, and various order operations with automatic cache invalidation.",
  "frontend/src/hooks/useSafeActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor with 15-second timeout protection, optional admin token initialization, and retry logic for non-auth errors.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light theme (purple primary, cyan secondary), admin tab styling, and card shadow utilities.",
  "frontend/src/lib/barcode/parseBarcodeData.ts": "Parses Code 128 barcode strings in format \"DESIGNCODE ORDERNUMBER\" and extracts design code and order number tokens.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates printable HTML for Karigar orders with PO codes, order tables, and summary statistics, triggering browser print dialog with iOS compatibility fallback.",
  "frontend/src/lib/exports/ordersExport.ts": "Exports orders to CSV with filtering by type (all, karigar, customer orders, daily) and generates downloadable files with appropriate filenames and sorting.",
  "frontend/src/lib/karigars/getKarigarColor.ts": "Assigns deterministic colors to karigars using a hash function and predefined color palette for consistent UI theming across cards and badges.",
  "frontend/src/lib/karigars/normalizeKarigarName.ts": "Normalizes karigar names by trimming whitespace, collapsing multiple spaces, and converting to lowercase for consistent comparison.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Maps parsed orders to master design entries, enriching them with generic names and karigar IDs while preserving meaningful PDF-derived karigar assignments and identifying unmapped orders.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace to ensure consistent matching across the application.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits an array of orders into batches of a specified size for processing or display pagination.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Calculates aggregate metrics from orders including totals, customer order counts, unique karigars/designs, and per-karigar statistics for pending and returned-from-hallmark orders.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats karigar names for display, returning 'Unassigned' for empty or whitespace-only values.",
  "frontend/src/lib/orders/formatOptionalNumber.ts": "Formats optional numeric fields (weight, size) to fixed decimals, returning empty strings for null/undefined/NaN values.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Generates deterministic PO codes for karigars using the first three letters of their name in uppercase followed by '01'.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Extracts the most relevant timestamp from an order (preferring lastStatusChange, then uploadDate, then createdAt) and converts from nanoseconds to a Date object.",
  "frontend/src/lib/orders/getStatusRowColor.ts": "Returns Tailwind CSS classes for row background colors based on normalized order status.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Determines if an order is a customer order by checking if the order type contains 'co' (case-insensitive).",
  "frontend/src/lib/orders/isTodayOrder.ts": "Checks if an order has activity today by comparing creation or last status change timestamps against today's date range.",
  "frontend/src/lib/orders/normalizeStatus.ts": "Normalizes status strings by trimming, lowercasing, and collapsing whitespace for consistent comparison.",
  "frontend/src/lib/orders/resolveKarigarName.ts": "Resolves karigar display name from ID by looking up in the karigars list, returning 'Unassigned' for missing or empty values.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts orders primarily by normalized design code and secondarily by order number after sanitizing invalid entries.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sorts orders by karigar name, then design code, then order number after sanitizing invalid entries.",
  "frontend/src/lib/orders/statusConstants.ts": "Defines order status constants, labels, and options for the five status types: pending, delivered, given to hallmark, returned from hallmark, and billed.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Validates and sanitizes order objects by checking required fields, filtering out invalid entries, and returning valid orders with a skipped count.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Extracts embedded images from Excel (.xlsx) files by unzipping the file structure and reading from the xl/media/ folder using JSZip.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses design-image mappings from Excel workbooks, validating exactly 3 columns (Sl no, Design code, Image) and extracting embedded images matched to rows. Returns parsed rows with validation status and error messages.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design data from SheetJS workbook objects with flexible column name matching for Design Code (required), Generic Name, and Karigar/Factory Name (optional). Returns array of tuples mapping design codes to MasterDesignEntry objects.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from SheetJS workbooks with flexible column matching, validates required fields (Order No, Order Type, Design Code), treats Weight/Size as optional, and detects customer orders. Returns orders array with non-blocking warnings for invalid optional fields.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Dynamically loads SheetJS library from CDN if needed, reads Excel files (.xlsx/.xls) as ArrayBuffer, and returns SheetJS workbook objects. Includes validation for sheet existence and user-friendly error messages.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Main entry point for parsing master design files, routing to PDF or Excel parsers based on file extension. Handles errors and provides user-friendly messages for both file types.",
  "frontend/src/lib/parsers/orderParser.ts": "Main order file parser that routes to Excel or PDF parsers based on file extension, handles errors with user-friendly messages, and returns both parsed orders and non-blocking warnings.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Dynamically loads pdfjs-dist from CDN and extracts text from PDF files page-by-page, grouping text items by Y-position to preserve line structure for tabular parsing. Returns array of pages, each containing array of lines.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses master design mappings from PDF text by finding a header row and extracting design code, generic name, and karigar name from subsequent table rows.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text supporting two formats: table-row format with explicit Karigar column, and section-header format with karigar names as headers.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single PDF line in table format extracting order details including karigar name from the last token and generic name from middle tokens.",
  "frontend/src/lib/reconciliation/compareOrdersWithExcel.ts": "Compares parsed Excel orders against existing non-billed orders, categorizing them as matched, missing, or unmapped based on design code and order number.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/offline/db.ts": "IndexedDB wrapper providing functions to cache orders, master designs, and queue ingestion batches for offline functionality.",
  "frontend/src/offline/sync.ts": "Manages offline sync state and processes queued order ingestions by uploading batches to backend and invalidating queries on success.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main admin dashboard with tabs for viewing orders (today, delivered, hallmark, total, customer, karigars), filtering, bulk actions (cancel, hallmark marking, partial fulfillment), metrics charts, and export functionality.",
  "frontend/src/pages/admin/BarcodeTaggingPage.tsx": "Page for scanning Code 128 barcodes to mark orders as 'Given for Hallmark' with two modes: Fast Scanner (continuous) and Batch Scanner (review before marking).",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Allows uploading Excel files containing design codes and embedded images, parses them, validates rows, and saves design-to-image mappings to the backend.",
  "frontend/src/pages/admin/ExcelReconciliationPage.tsx": "Compares uploaded Excel order files against existing orders to identify matched, missing, and unmapped orders, with bulk import functionality for missing entries.",
  "frontend/src/pages/admin/HallmarkManagementPage.tsx": "Displays orders marked as 'Given for Hallmark' grouped by date with summary statistics and bulk action to mark selected orders as 'Billed'.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Manages master design entries with search, filtering by karigar, add/edit/import dialogs, and displays designs in a table with associated karigar information.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin page for managing users, including creating new user profiles, approving/rejecting users, and blocking/unblocking users with role-based access control.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Dashboard for karigar (craftsmen) users showing their assigned orders with metrics, filtering by karigar tabs, and bulk marking orders as delivered.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that handles Internet Identity authentication and redirects users to role-appropriate dashboards after verifying identity, actor, profile, and role.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "One-time setup page for initializing the first administrator by entering a bootstrap token that gets stored in session parameters.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Staff page for uploading and parsing order files (Excel/CSV), applying master design mappings, previewing orders, and batch uploading them with progress tracking.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Staff dashboard displaying orders across multiple tabs (today, total, hallmark, customer) with comprehensive filtering, search, and export capabilities.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Staff page showing design codes from orders that lack master design mappings, allowing staff to create new master design entries for unmapped codes.",
  "frontend/src/pwa/clearPwaCaches.ts": "Utility function to clear all browser cache storage entries and unregister service workers for best-effort cleanup after rollback.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers service worker with automatic update checking every minute, handles update adoption via SKIP_WAITING message, and reloads page on controller change.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped canister or network errors, extracts canister IDs from error messages, and provides user-friendly error messages with diagnostic tags.",
  "frontend/src/utils/errorPresentation.ts": "Presents errors to users with friendly messages by decoding URL-encoded errors, classifying error types (stopped canister, network, unauthorized, etc.), and extracting user-facing messages from backend errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, persisting parameters in sessionStorage, and clearing sensitive parameters from URL hash without page reload.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the promise doesn't resolve within the specified duration, with proper cleanup of timeout handlers.",
  "frontend/src/version.ts": "Exports build identifier constant set to 'v54' for Version 54 rollback tracking.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom color scheme using CSS variables for theming (primary, secondary, destructive, success, warning, etc.), custom spacing, z-index values, and typography plugin.",
  "project_state.json": "Project state document for KarigarFlow jewellery order management system tracking two critical issues: authentication loop after login and black-on-beige UI visibility problem making content unreadable."
}