{
  "backend/main.mo": "Main Motoko canister defining types, state maps, authorization mixins, storage, and helpers for orders, designs, users, and karigar records.",
  "backend/migration.mo": "Migration module that maps old actor state to the new format and initializes karigar storage.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files describing their roles in the application.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and base styles for light and dark modes.",
  "frontend/index.html": "Root HTML document loading the React application entrypoint.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and startup behavior.",
  "frontend/public/service-worker.js": "Service worker implementing caching, offline support, and cache version management.",
  "frontend/src/App.tsx": "Sets up routing and authentication bootstrap logic, handling identity, user profile, admin checks, loading states, and error screens. Renders appropriate dashboards or access/blocked/setup screens based on user state.",
  "frontend/src/components/admin/TotalQtyBreakdownDialog.tsx": "Displays a dialog showing total quantity breakdown with computed totals and styled item list. Uses cards and color-coded values.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with an icon and a button to return to the dashboard.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Shows a blocked user notice with details and a logout option that clears identity and queries.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Displays bootstrap errors during profile loading with error details, retry, and logout options.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button handling II auth, including retry logic and visual states.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Shows a screen for authenticated users without a profile, displaying their principal ID and instructions.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for initial admin profile setup that collects a name and triggers profile-related cache invalidation.",
  "frontend/src/components/auth/RoleGate.tsx": "Guards children based on allowed roles, showing loaders or access denied when applicable.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Renders a table of design‑image mappings with design info, an image badge, and formatted creation dates.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Dialog that fetches and displays a design image with loading, error, and no‑image states.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary that shows a friendly error screen with details and options to reload or clear session.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel showing technical error details with copy‑to‑clipboard support.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert with optional retry and expandable technical error details.",
  "frontend/src/components/exports/ExportActions.tsx": "Dropdown UI for exporting orders as CSV or Karigar-specific PDF/JPEG files with filtering and status handling.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Export bar for a single karigar allowing daily or total PDF/JPEG export of their orders.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Control panel to filter orders by date or design code and export them as PDF or JPEG.",
  "frontend/src/components/karigar/AddKarigarDialog.tsx": "Dialog form for creating a new karigar using a mutation and showing toast feedback.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Displays a dialog showing detailed order info for a karigar, including metadata and a design image viewer.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with role‑based navigation, mobile menu handling, and status indicators.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Provides a dialog form to create or edit master design mappings, including selecting a karigar and saving via mutation.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Handles importing master designs from a file, parsing entries, previewing results, and saving them in bulk.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Renders a table of master designs with edit and activate/deactivate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Shows a preview of ingested orders with unmapped code highlighting and formatted order details.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Displays a warning banner when skipped or invalid orders are detected and offers a clear‑cache action.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Renders a filter bar for orders with search, karigar, status, date, and type toggles, computing unique values from sanitized orders. Calls onFiltersChange when filters update and supports clearing all filters.",
  "frontend/src/components/orders/OrdersTable.tsx": "Displays a table of sanitized orders with optional selection mode, highlighting, and RB edit/view actions. Handles row selection logic and shows a fallback when no orders exist.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog for entering partial supplied quantities for multiple RB orders with validation. Manages quantity state, errors, and returns valid quantities on confirm.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog to edit the total supplied quantity of a single RB order with validation. Submits updates via a mutation hook and shows success or error feedback.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Shows backend reachability status with refresh, canister ID display, and expandable error details. Uses reachability and clipboard hooks to provide online/offline indicators.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Displays online/offline status and pending offline sync queue information. Allows manual sync when online and pending uploads exist.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs a health check on the backend and reports reachability status and health data.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy functionality with simple success/error status and button labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile using a safe actor, handling auth and bootstrap-related errors.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Computes the user's effective app role by combining profile data with backend admin detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity loading through a React context.",
  "frontend/src/hooks/useOrdersCache.ts": "Hydrates orders from IndexedDB, merges with backend data, persists updates, and manages cache cleanup.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating orders, designs, and related backend data via the actor.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor with timeout and safe initialization logic, handling errors and retries cautiously.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, and custom admin tab styles.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates and triggers a printable HTML/PDF export for karigar orders with iOS handling and summary data.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters orders by export type and generates a downloadable CSV with sorted and formatted fields.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders, resolving generic and karigar names and tracking unmapped entries.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits an orders list into fixed-size batches.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate order metrics including totals and per‑karigar statistics.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Normalizes karigar names, returning 'Unassigned' for blank values.",
  "frontend/src/lib/orders/formatOptionalNumber.ts": "Formats optional numeric fields with fixed decimals or returns empty strings.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Creates a deterministic PO code from a karigar name using its first three letters.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Returns an order’s timestamp from uploadDate or createdAt, converted from nanoseconds.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Checks whether an order type string represents a customer order.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts sanitized orders by normalized design code and order number.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sorts sanitized orders by formatted karigar name, design code, and order number.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Validates PersistentOrder objects and filters invalid entries while logging skips.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Extracts embedded images from XLSX files using JSZip, returning basic positional metadata.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses an Excel sheet into rows linking serial numbers and design codes to embedded images, validating required columns and extracting image bytes per row.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Reads master design data from the first worksheet, normalizes header names, matches required/optional columns, and outputs design code–entry pairs.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from an Excel sheet with flexible column matching, validates required fields, handles optional numeric fields, and returns orders with warnings.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads SheetJS dynamically if needed, reads an Excel file into a workbook, and validates that at least one sheet exists.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Routes master design parsing based on file type, using PDF text extraction or Excel parsing with unified error handling.",
  "frontend/src/lib/parsers/orderParser.ts": "Selects PDF or Excel order parsing, processes the file, and returns parsed orders with warnings and friendly error messages.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Dynamically loads PDF.js and extracts per-page text grouped into lines using positional data for downstream table parsing.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Extracts master design entries from flattened PDF text by locating a header row and parsing subsequent lines into design code, generic name, and karigar name.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text using table-row format first and falling back to section-header mode, generating PersistentOrder objects with timestamps.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single PDF table-row line into a PersistentOrder when formats match expected tokens including generic name, numeric fields, and karigar name.",
  "frontend/src/main.tsx": "Sets up the React app root with QueryClient and InternetIdentity providers before rendering App.",
  "frontend/src/offline/db.ts": "Provides IndexedDB-based caching for orders, master designs, metadata, and ingestion queue operations.",
  "frontend/src/offline/sync.ts": "Implements an offline sync hook that uploads queued ingestion batches and updates sync state while managing retries and query invalidation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard managing orders, filters, tabs, exports, dialogs, and cache interactions for various order views.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Handles uploading, parsing, and saving design image mappings from an Excel file with validation and UI feedback.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Displays and manages master design mappings with search, add, import, and edit functionality.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Provides UI for creating users, managing approvals, and blocking or unblocking user accounts.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Shows active orders for a karigar with filtering, metrics, cache handling, and bulk delivery actions.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with branding, background image, and an II LoginButton.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Initializes the first admin by storing a bootstrap token and refreshing actor state.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Parses order spreadsheets, applies master design mapping, previews results, and uploads orders in batches with progress tracking.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Dashboard page fetching orders and activity logs, managing filters and tabs, and rendering tables and dialogs for staff workflows.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Displays unmapped design codes grouped and filterable, with a dialog to create master design mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, listens for updates, and logs activation events with periodic update checks.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped-canister, network, or generic types and extracts safe error details.",
  "frontend/src/utils/errorPresentation.ts": "Generates user-friendly error messages by decoding, classifying, and formatting backend and network errors.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it doesn't resolve within the specified duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Project state JSON describing feature requirements and pending requests for managing Karigar assignments in the Master Design admin portal."
}