{
  "backend/main.mo": "Defines the main canister actor with order, design, user, karigar, image, access control, and storage types and state maps, plus validation helpers and authorization mixins.",
  "backend/migration.mo": "Simple migration module that transfers karigarStorage from the old actor structure to the new one unchanged.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, affected files, components, and test IDs for recent frontend changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend components, pages, and hooks.",
  "frontend/index.css": "Tailwind CSS configuration with theme variables, light/dark mode tokens, and global style resets.",
  "frontend/index.html": "HTML entry point loading the root React app via main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, and icon assets.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first and network-first strategies for assets and documents, with install, fetch, and activate handlers.",
  "frontend/src/App.tsx": "Main React app router and bootstrap flow handling auth, role checks, blocked users, error states, and route layout rendering.",
  "frontend/src/components/admin/TotalQtyBreakdownDialog.tsx": "Displays a dialog showing total and categorized quantity breakdown with computed grand total.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Displays a blocked account message and provides a logout action clearing identity and queries.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Handles profile bootstrap errors with retry, logout, and detailed error presentation.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button handling Internet Identity auth state and errors.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Informs authenticated users without profiles and lets them copy their principal ID and refresh.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first admin user to set their name and complete initial profile setup.",
  "frontend/src/components/auth/RoleGate.tsx": "Guards child components by role, showing loading or access denied when appropriate.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Renders a table listing design image mappings with codes, names, and creation dates.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Dialog to fetch and display a design image with loading, error, and no-image states.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Error boundary that catches app errors, shows details, and offers reload or logout options.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel that shows technical error details and allows copying the raw error string.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert that displays a message, optional retry button, and optional technical details panel.",
  "frontend/src/components/exports/ExportActions.tsx": "Dropdown export menu for orders, supporting CSV exports and per-karigar PDF/JPEG downloads.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Export toolbar for a specific karigar, allowing PDF/JPEG exports for daily or total orders.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Filter-based export controls enabling PDF/JPEG export of karigar orders by date or design code.",
  "frontend/src/components/karigar/AddKarigarDialog.tsx": "Dialog to create a new karigar with form submission and success/error handling.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Dialog to view full karigar order details, including metadata and image viewer access.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application shell with role-based navigation and responsive mobile/desktop menus.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Provides a dialog form for creating or editing master designs, handling karigar lookup, validation, and save mutations.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Implements a dialog to import master designs from files, parse them, show a summary, and save results.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Renders a table of master designs with edit and activation toggles.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Displays a preview table of ingested orders, highlighting unmapped codes and showing order details.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Shows a warning banner when invalid cached orders are detected, with an option to clear the cache.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Provides UI controls to filter orders by karigar, status, date range, order number, and flags, using sanitized orders to generate unique filter options.",
  "frontend/src/components/orders/OrdersTable.tsx": "Renders a table of sanitized orders with optional row selection, action buttons, and conditional styling for returned orders.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog allowing users to enter partial supplied quantities per order with validation before confirming.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog for editing an RB order’s total supplied quantity with validation and mutation submission.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Displays backend reachability status with refresh controls, canister ID visibility, and error details.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Shows online/offline status and pending sync queue, allowing manual sync when online.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on Internet Identity, initializes access control, and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs a health check on the backend using a safe actor and reports reachability status and errors.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy functionality with success/error state and dynamic button labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile via a safe actor with error classification and controlled retry behavior.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Computes the user's effective app role by combining profile data with backend admin checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and provides identity context to the app.",
  "frontend/src/hooks/useOrdersCache.ts": "Hydrates orders from IndexedDB, merges them with backend data, sanitizes cache, and exposes loading/error states.",
  "frontend/src/hooks/useQueries.ts": "Defines various data-fetching and mutation hooks using the actor for orders, designs, and related backend operations.",
  "frontend/src/hooks/useSafeActor.ts": "Creates an actor with timeout handling, safe access control initialization, and non-retryable error detection.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables plus custom admin tab styles.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates a printable HTML/PDF export of Karigar orders with totals, table output, and iOS-safe download handling.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters orders by export type and generates a downloadable CSV with sorted rows where applicable.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Maps orders to master design entries, preserving meaningful karigar names and reporting mapped/unmapped results.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace for consistent matching.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits orders into fixed-size batches with basic validation.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes total and per-karigar order metrics after sanitizing invalid entries.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Trims karigar names and converts empty values to 'Unassigned'.",
  "frontend/src/lib/orders/formatOptionalNumber.ts": "Formats optional numeric fields with fixed decimals or returns empty string if invalid.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Creates deterministic PO codes from karigar names using the first three letters and a fixed suffix.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Returns an order's timestamp from uploadDate or createdAt, converting nanoseconds to milliseconds.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Determines if an order type indicates a customer order by checking for 'co'.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts valid orders by normalized design code and then by order number.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sorts valid orders by formatted karigar name, then design code, then order number.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Validates order objects and filters invalid entries while logging skipped items.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Extracts embedded images from XLSX files using JSZip, mapping them to sequential rows.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses an Excel sheet with 3 required columns and extracts embedded images mapped by row. Validates headers, locates images, and returns parsed rows with errors when fields or images are missing.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Reads master design mappings from an Excel workbook using flexible column name matching. Extracts design code plus optional generic and karigar names into structured entries.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from an Excel sheet with flexible headers, handling required fields, optional numeric fields, and row-level errors and warnings. Produces validated PersistentOrder objects along with warnings.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Dynamically loads SheetJS if needed and reads an Excel file into a workbook. Validates the workbook and provides clear error messages for loading or parsing failures.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Routes master design parsing to either PDF or Excel handlers based on file type. Wraps parsing with error handling and uses shared Excel/PDF parsing utilities.",
  "frontend/src/lib/parsers/orderParser.ts": "Determines whether to parse orders from PDF or Excel, delegating to the appropriate parser. Returns parsed orders with warnings and handles user‑friendly error reporting.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Dynamically loads PDF.js and extracts structured text from each page, grouping text by lines for downstream table parsing. Handles common PDF errors with descriptive messages.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Flattens PDF text lines, detects a header row, and extracts design code, generic name, and karigar name into MasterDesignEntry tuples.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text using table-row or section-header modes, building PersistentOrder objects with timestamps and validations.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single table-format PDF row into a PersistentOrder, validating formats and extracting numeric fields and karigar name.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for orders, master designs, and queued ingestion batches with CRUD helpers.",
  "frontend/src/offline/sync.ts": "Provides a React hook to sync queued offline ingestions, uploading batches and updating UI sync state.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabs, filters, cached data handling, and order management UI components.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Handles uploading, parsing, previewing, and saving design image mappings from Excel files.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Displays and manages master design mappings with search, add, edit, and import features.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Provides user creation, approval management, and block/unblock controls for administrators.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Shows karigar orders, filtering tools, approval request flow, and bulk delivery actions.",
  "frontend/src/pages/LoginPage.tsx": "Renders a styled login screen with branding and an Internet Identity login button.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Initializes the first admin using a bootstrap token and refreshes actor sessions.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Parses order files, applies master design mappings, previews results, and uploads orders in batches.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Staff dashboard showing orders, activity logs, filters, tabs, and dialogs with filtering logic and cached data handling.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Displays unmapped design codes grouped by code with search, error handling, and a dialog to create master design mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, logs update events, and periodically checks for service worker updates.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped canister, network, or generic categories and extracts safe diagnostic info.",
  "frontend/src/utils/errorPresentation.ts": "Generates user-friendly error messages using bootstrap classification and decoding logic for display.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters for routing state.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout and rejects if it exceeds the specified duration.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and plugin support.",
  "project_state.json": "Project state metadata outlining karigar dropdown issues, existing features, and new backend/UX requests for KarigarFlow."
}