{
  "backend/main.mo": "Main Motoko actor implementing a jewellery order management system with persistent storage for orders, master designs, karigars, user profiles, activity logs, design images, and authorization/approval mixins.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: fixing black-on-black text visibility, creating Excel order reconciliation, and building barcode tagging with fast scanner mode.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, pages, and utilities describing their functionality, props, and integration points.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for the Cyber Bunker theme.",
  "frontend/index.html": "HTML entry point with PWA meta tags, viewport configuration for mobile, manifest link, and theme color definition for the KarigarFlow application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode, theme colors, and start URL for installable web app functionality.",
  "frontend/public/service-worker.js": "Service worker (v54) implementing cache-first strategy for static assets, network-first for navigation, with skip waiting and cache cleanup on activation.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, role-based routing, authentication guards, profile setup flow, blocked user handling, and routes for admin/staff/karigar dashboards plus reconciliation, barcode tagging, and hallmark management pages.",
  "frontend/src/components/admin/KarigarSummaryCards.tsx": "Displays summary cards for each karigar showing total orders and quantity, with filtering capability and visual selection state. Aggregates order data by karigar and provides interactive cards with color-coded badges.",
  "frontend/src/components/admin/MetricsChart.tsx": "Renders four metric cards displaying total orders, total quantity, total weight, and customer orders count. Computes aggregated statistics from the orders array.",
  "frontend/src/components/admin/TotalQtyBreakdownDialog.tsx": "Modal dialog that displays a breakdown of total quantity across different categories (delivered, hallmark, total orders, customer orders, karigars). Shows grand total and individual category values with color-coded display.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with an alert icon and a button to navigate back to the dashboard. Used when users lack permission for a specific page.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Full-screen component shown to blocked users with an alert message and logout button. Clears authentication and query cache on logout.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen displayed when user profile fails to load, showing error details, retry and logout options. Includes error presentation with friendly messages and raw error details panel.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button that handles login/logout with Internet Identity, clearing query cache and PWA caches on logout. Shows loading state during authentication.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Screen shown to authenticated users without a profile, displaying their Principal ID with copy functionality and instructions to contact an administrator. Includes refresh button to check for profile creation.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first-time admin setup allowing the initial administrator to enter their name. Only shown to the first user who is automatically assigned the Admin role.",
  "frontend/src/components/auth/RoleGate.tsx": "Authorization component that checks user's effective role against allowed roles, showing loading state, access denied screen, or children based on permissions. Guards route access based on AppRole.",
  "frontend/src/components/barcode/BarcodeOrdersList.tsx": "Displays a searchable table of orders with visual indicators for highlighted and scanned orders, showing order details like design code, karigar, status, and quantity.",
  "frontend/src/components/barcode/BatchOrdersTable.tsx": "Renders a table of orders in a batch with a remove action button for each order, displaying order details and status.",
  "frontend/src/components/barcode/BatchScannerView.tsx": "Implements batch barcode scanning mode where multiple orders can be scanned and accumulated before marking them all as 'Given for Hallmark' in a single operation.",
  "frontend/src/components/barcode/FastScannerView.tsx": "Implements fast single-scan mode where each scanned order is immediately highlighted and can be marked for hallmark individually, tracking scanned orders in the session.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Displays a table of design image mappings showing design code, generic name, image availability badge, and creation date.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Modal dialog that fetches and displays a design image for a given design code, handling loading, error, and empty states.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches application errors and displays a friendly error UI with options to reload or logout/clear session.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Reusable collapsible panel that displays technical error details with a copy-to-clipboard button for error strings.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Displays an inline error alert with optional retry button, showing error details and handling stopped-canister errors specifically.",
  "frontend/src/components/exports/ExportActions.tsx": "Dropdown menu component for exporting orders in various formats (CSV for all/CO/daily, PDF/JPEG per karigar) with filtering by date and karigar.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Export dropdown for a specific karigar's orders, allowing PDF/JPEG export of either daily or total orders with date filtering.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Card-based export controls with filtering options (all/date/design) and buttons to export filtered orders as PDF or JPEG.",
  "frontend/src/components/hallmark/HallmarkOrdersGroupedByDate.tsx": "Collapsible date-grouped view of hallmark orders with selection support, showing order counts and total quantities per date.",
  "frontend/src/components/hallmark/HallmarkOrdersTable.tsx": "Table component displaying hallmark orders with multi-select checkboxes and columns for order details (order no, design, karigar, qty, weight, etc.).",
  "frontend/src/components/karigar/AddKarigarDialog.tsx": "Dialog form for adding new karigars with duplicate detection using normalized name comparison (case/spacing insensitive).",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Dialog component that displays detailed order information for karigars, including design code, generic name, weight, size, quantity, status, remarks, and date, with a button to view the design image.",
  "frontend/src/components/karigar/TotalKarigarListDialog.tsx": "Dialog component that displays a searchable, scrollable list of all karigars with loading, error, and empty states, allowing selection of a karigar via callback.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout component that renders a sticky header with role-based navigation (Admin, Staff, Karigar), mobile menu support, connectivity status, backend status indicator, and user authentication controls.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Dialog form component for creating or editing master design entries with fields for design code, generic name, karigar selection, and active status.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog component that handles bulk import of master designs from PDF or Excel files, parsing the file, showing a preview with create/update summary, and saving to the backend.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Table component that displays master designs with columns for design code, generic name, karigar name, and status, providing edit and toggle active/inactive actions for each row.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Displays a preview table of orders to be ingested, highlighting unmapped design codes with warning icons and showing order details including karigar assignments derived from PDFs.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Shows a destructive alert banner when invalid orders are detected in cache, with a button to clear cache and reload.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Provides a comprehensive filter bar for orders with search, date range, karigar selection, status filtering, and CO/RB-only checkboxes with a clear filters button.",
  "frontend/src/components/orders/OrdersTable.tsx": "Renders the main orders table with selectable rows, status-based row coloring, and a design image viewer dialog triggered by action buttons.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog for specifying partial quantities when fulfilling RB orders, with validation to ensure quantities don't exceed original order amounts.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog for editing the total supplied quantity of an RB order, with validation and mutation hook to update the backend.",
  "frontend/src/components/reconciliation/ReconciliationFileUpload.tsx": "File upload component for Excel reconciliation files with drag-and-drop styling, file info display, and parsing state indication.",
  "frontend/src/components/reconciliation/ReconciliationReport.tsx": "React component that displays a reconciliation report with collapsible sections for matched, missing, and unmapped orders, showing order details in tables with status badges.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Compact header component displaying backend connection status (online/offline/checking) with canister ID display, refresh button, and collapsible error details panel.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Status bar component that monitors online/offline connectivity and displays pending sync queue count with a manual sync button.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token.",
  "frontend/src/hooks/useBackendReachability.ts": "Hook that periodically polls backend health check endpoint every 30 seconds, classifying errors and returning online/offline/checking status with health data.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Simple hook providing clipboard copy functionality with idle/success/error status tracking and user-friendly button labels.",
  "frontend/src/hooks/useCurrentUser.ts": "React Query hook that fetches the current user's profile from the backend actor, with error classification and retry logic for authorization failures.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Hook that derives the effective app role by combining user profile role with backend admin check, ensuring admin principals are always treated as Admin.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flow, and identity persistence with configurable options.",
  "frontend/src/hooks/useOrdersCache.ts": "React hook that hydrates orders from IndexedDB on mount, merges cached and backend data, sanitizes invalid entries, and provides loading/error states with cache management functions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching orders, master designs, karigars, unmapped design codes, and mutations for uploading/updating data with automatic cache invalidation.",
  "frontend/src/hooks/useSafeActor.ts": "React Query hook that creates an authenticated or anonymous actor with 15-second timeout, handles admin token initialization, and provides retry logic for non-retryable errors.",
  "frontend/src/index.css": "Tailwind CSS configuration with Cyber Bunker theme (black background, electric purple/cyan accents) using OKLCH color space, includes grid pattern background and icon hover effects.",
  "frontend/src/lib/barcode/parseBarcodeData.ts": "Parses Code 128 barcode data to extract design code and order number from whitespace-separated format (e.g., 'CHIMN40103 1308').",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates printable HTML for karigar orders with iOS compatibility, creates formatted tables with order details, summary statistics, and triggers browser print dialog for PDF export.",
  "frontend/src/lib/exports/ordersExport.ts": "Exports orders to CSV format with filtering by type (all/karigar/customer/daily), includes sorting by karigar, and generates downloadable CSV files with formatted order data.",
  "frontend/src/lib/karigars/getKarigarColor.ts": "Provides deterministic color assignment for karigar names using hash-based selection from 12 predefined colors, with utility functions for card and badge CSS classes.",
  "frontend/src/lib/karigars/normalizeKarigarName.ts": "Normalizes karigar names by trimming whitespace, collapsing multiple spaces, and converting to lowercase for consistent comparison.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders, enriching them with genericName and karigarId from master designs while preserving meaningful PDF-derived karigar IDs and treating empty/whitespace/\"Unassigned\" values as missing.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming whitespace and collapsing repeated internal spaces to ensure consistent matching.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits an array of orders into batches of a specified size for processing.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Calculates order metrics (total orders, quantity, weight, customer orders) grouped by karigar, filtering only Pending and Returned from Hallmark statuses.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats karigar names for display, returning \"Unassigned\" for empty or whitespace-only values.",
  "frontend/src/lib/orders/formatOptionalNumber.ts": "Formats optional numeric fields (weight, size) to fixed decimals, returning empty string for null/undefined/NaN values.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Generates deterministic PO codes for karigars using the first 3 letters uppercase plus \"01\" (e.g., \"Momin\" → \"MOM01\").",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Extracts the most relevant timestamp from an order (preferring lastStatusChange, then uploadDate, then createdAt) and returns it as a Date object.",
  "frontend/src/lib/orders/getStatusRowColor.ts": "Maps normalized order status strings to Tailwind CSS background color classes for visual differentiation.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Determines if an order is a customer order by checking if the orderType contains \"co\" (case-insensitive).",
  "frontend/src/lib/orders/isTodayOrder.ts": "Checks if an order has activity today by comparing its creation or lastStatusChange timestamp against today's date range.",
  "frontend/src/lib/orders/normalizeStatus.ts": "Normalizes status strings by trimming, lowercasing, and collapsing repeated spaces for consistent comparison.",
  "frontend/src/lib/orders/resolveKarigarName.ts": "Resolves karigar name from karigarId using a karigar list, returning \"Unassigned\" for null/undefined/empty values.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts orders primarily by normalized design code and secondarily by order number after sanitizing invalid entries.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sorts orders by karigar name, then design code, then order number after sanitizing invalid entries.",
  "frontend/src/lib/orders/statusConstants.ts": "Defines order status constants (pending, delivered, given_to_hallmark, etc.) with labels and options for UI components.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Validates and sanitizes PersistentOrder objects, filtering out invalid entries and returning valid orders with a skipped count.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Extracts embedded images from Excel (.xlsx) files by unzipping the file and reading from the xl/media/ folder using JSZip.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses design-image mappings from a 3-column Excel workbook (Sl no, Design code, Image), extracting embedded images and validating each row.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design mappings from Excel workbooks with flexible column name matching (Design Code, Generic Name, Karigar/Factory Name). Returns tuples of design codes and MasterDesignEntry objects with validation and error handling.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from Excel workbooks with flexible column matching, numeric field validation, and customer order detection. Returns PersistentOrder array with warnings for invalid optional fields (weight/size) and detailed row-level error messages.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Dynamically loads SheetJS library from CDN and reads Excel files (.xlsx/.xls) into workbook objects. Validates file format and sheet existence with user-friendly error messages.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Main entry point for parsing master design files, routing to PDF or Excel parsers based on file extension. Handles errors and provides user-friendly messages for both formats.",
  "frontend/src/lib/parsers/orderParser.ts": "Main order file parser that routes to Excel or PDF parsers based on file type. Returns ParseResult with orders array and non-blocking warnings, with comprehensive error handling.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Dynamically loads pdfjs-dist from CDN and extracts text from PDF files page-by-page. Groups text items by Y-position to preserve line structure for tabular parsing with error handling for corrupted/protected PDFs.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses master design mappings from extracted PDF text by finding header rows and parsing whitespace-separated tokens into design code, generic name, and karigar name fields.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text with dual-mode support: attempts table-row format with explicit Karigar column first, then falls back to section-header format where karigar name is a section header.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single PDF line in table format with explicit Generic Name and Karigar columns, extracting karigar from the last token and returning a fully populated Order or null.",
  "frontend/src/lib/reconciliation/compareOrdersWithExcel.ts": "Compares parsed Excel orders against existing non-billed orders, returning matched (duplicates), missing (new), and unmapped (design code not in master) orders.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/offline/db.ts": "IndexedDB wrapper providing functions to cache orders, master designs, queue ingestions, and manage metadata for offline functionality.",
  "frontend/src/offline/sync.ts": "Custom hook for offline sync that processes queued order ingestions, uploads them when online, and manages sync state with error handling and retry logic.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main admin dashboard with tabbed views for today's orders, delivered, hallmark, total, customer orders, and karigars, featuring filtering, bulk actions, exports, and order management mutations.",
  "frontend/src/pages/admin/BarcodeTaggingPage.tsx": "Barcode tagging page with two scanner modes (fast continuous and batch review) for scanning Code 128 barcodes to mark orders as given for hallmark.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Admin page for uploading and managing design image mappings from Excel files. Parses Excel workbooks to extract design codes and associated images, validates them, and saves mappings to the backend.",
  "frontend/src/pages/admin/ExcelReconciliationPage.tsx": "Admin page for reconciling orders from customer portal Excel files against existing orders. Compares parsed Excel orders with database orders to identify matched, missing, and unmapped entries, with bulk import functionality.",
  "frontend/src/pages/admin/HallmarkManagementPage.tsx": "Admin page for managing orders marked as 'Given for Hallmark'. Displays orders grouped by date with summary statistics and allows bulk selection and status updates to 'Billed'.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Admin page for managing master design entries with CRUD operations. Features search, karigar filtering, manual design addition, Excel import, and displays designs in a table with edit capabilities.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin page for managing user profiles, approvals, and access control. Allows creating users with roles, approving/rejecting user requests, and blocking/unblocking users with a table view of all profiles.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Karigar dashboard page displaying active orders with metrics (total orders, quantity, weight), tabbed filtering by karigar, and bulk mark-as-delivered functionality.",
  "frontend/src/pages/LoginPage.tsx": "Login page component displaying KarigarFlow branding with a LoginButton over a background pattern image.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "One-time admin bootstrap page that accepts a secure token to initialize the first administrator account and redirects to home after success.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Staff page for uploading and parsing order files (Excel/CSV), applying master design mappings, previewing parsed orders, and batch uploading to backend with progress tracking.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Staff dashboard with tabbed views (today, total, hallmark, customer orders), advanced filtering by date/karigar/status/order type, metrics cards, and export actions.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Page listing design codes from orders that lack master design mappings, allowing staff to search and add new master design entries via dialog.",
  "frontend/src/pwa/clearPwaCaches.ts": "Utility function to clear all browser cache storage entries and unregister service workers for cleanup after rollback or updates.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates periodically, and automatically activates new service workers with page reload on controller change.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped canister or network errors, extracts canister IDs from error messages, and provides user-friendly error messages and diagnostic tags.",
  "frontend/src/utils/errorPresentation.ts": "Presents errors to users with friendly messages by decoding URL-encoded errors, reusing bootstrap error classification, and extracting user-facing messages from backend errors.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and functions to clear sensitive parameters from URLs.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the promise doesn't resolve within the specified duration.",
  "frontend/src/version.ts": "Exports a build identifier constant set to 'v54' for version rollback tracking.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using CSS variables, extended spacing and z-index values, and plugins for animations and typography.",
  "project_state.json": "Project state document describing an order management system with Excel reconciliation, dual-mode barcode scanner for Hallmark order tagging, and a critical issue with black-on-black text visibility in the Cyber Bunker theme."
}