{
  "backend/main.mo": "Defines the main canister actor with persistent data structures, authorization mixins, storage handling, and helper functions for orders, users, designs, and activity logging.",
  "backend/migration.mo": "Provides migration logic converting old persistent actor state to the new structure while preserving stored maps, logs, and approval data.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test references for rollback, versioning, and cache‑related changes.",
  "frontend-file-summaries.txt": "Aggregated descriptions of frontend files summarizing functionality across pages, hooks, components, and UI behavior.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, theming, and global base styles for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React application through main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and icons for installation.",
  "frontend/public/service-worker.js": "Service worker implementing versioned caching (v54), offline handling, automatic activation, and cleanup of old caches.",
  "frontend/src/App.tsx": "Defines the app’s main router layout, handling authentication, bootstrap checks, profile loading, admin checks, and routing to dashboards or error screens.",
  "frontend/src/components/admin/TotalQtyBreakdownDialog.tsx": "Displays a dialog showing a computed total and itemized quantity breakdown with styled cards and list entries.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access-denied message with a button to navigate back to the dashboard.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Shows a blocked‑user notice and allows the user to log out and clear cached data.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Displays bootstrap‑loading errors with retry and logout options and optional detailed error info.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and PWA cache clearing on logout.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Informs authenticated users without profiles to contact an admin and copy their principal ID.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time admin setup allowing entry of a name and triggering profile and admin-state refresh.",
  "frontend/src/components/auth/RoleGate.tsx": "Guards children by permitted roles, showing loading or access‑denied screens as needed.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Renders a table of design‑image mappings with design details and creation dates.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Displays a dialog that loads and shows a design image for a given code with loading and error states.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "A global error boundary that shows a friendly error screen with details and options to reload or clear session.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel that shows technical error details and allows copying the raw error string.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert component with optional retry and expandable technical details.",
  "frontend/src/components/exports/ExportActions.tsx": "Provides export menu for CSV and karigar-specific PDF/JPEG exports based on filtered orders.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Export controls for a single karigar allowing daily or total PDF/JPEG export of orders.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Form-based filtering UI that exports orders by date, design code, or all in PDF/JPEG format.",
  "frontend/src/components/karigar/AddKarigarDialog.tsx": "Dialog for creating a new karigar with duplicate name validation and submission handling.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Renders a dialog showing detailed order info for a karigar with optional image viewer support.",
  "frontend/src/components/karigar/TotalKarigarListDialog.tsx": "Displays a searchable, scrollable dialog listing all karigars with loading and error states.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application shell with role‑based navigation and mobile/desktop layouts.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Handles creating and editing master designs, including karigar selection, validation, and confirmation flows.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Supports importing master designs from a file with parsing, preview, and bulk save functionality.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Renders a table of master designs with edit and activate/deactivate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Displays a scrollable table preview of ingested orders, highlighting unmapped design codes and showing basic order details. Includes visual indicators for mapping status and PDF-derived karigar names.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Shows a destructive alert when invalid orders are detected in cache and provides a button to clear local cache. Hides itself if no invalid items are present.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Renders a filter toolbar for orders, offering karigar, status, date, CO/RB toggles, and optional order number search. Computes unique filter values from sanitized orders and propagates filter changes upward.",
  "frontend/src/components/orders/OrdersTable.tsx": "Displays a table of sanitized orders with optional selection mode, RB supplied editing, and design image viewing actions. Handles row selection logic and conditionally highlights selected items.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog for entering partial fulfillment quantities for multiple orders, with validation ensuring quantities are positive and within limits. On confirmation returns a map of updated quantities.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog allowing editing of an RB order's total supplied quantity with validation and a mutation call. Preloads existing quantity and shows errors or success via toast notifications.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "UI component showing backend reachability, canister ID, and refresh/copy options with collapsible details.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Displays online/offline status and pending sync state, with manual sync control when online.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs backend health checks, classifies errors, and exposes reachability status and canister info.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Clipboard-copy hook providing status feedback and helper label text.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and caches the current user profile with error classification and controlled retry behavior.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Derives the user's effective app role by combining profile data with backend admin detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout helpers, and persistence via AuthClient.",
  "frontend/src/hooks/useOrdersCache.ts": "Hydrates orders from IndexedDB, merges with backend data, sanitizes cache, and exposes loading/error states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating orders, master designs, and related backend data with cache invalidation.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor with timeout, authentication handling, and optional admin initialization using React Query.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and styles for admin tabs with responsive behavior.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Builds and downloads a printable HTML/PDF view of karigar orders with summary and table formatting.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters orders by type and generates downloadable CSV exports with formatted fields.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders, producing mapped/unmapped sets and preview results.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace for consistent matching.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits an orders array into fixed-size batches with error handling for invalid sizes.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate metrics and per-karigar statistics from validated orders.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats karigar names, returning 'Unassigned' for empty values.",
  "frontend/src/lib/orders/formatOptionalNumber.ts": "Provides helpers for safely formatting optional numeric fields to fixed decimals.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Generates a deterministic PO code from a karigar name using a three-letter prefix and suffix.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Returns a Date for an order, preferring uploadDate over createdAt and converting nanoseconds to milliseconds.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Checks if an orderType string indicates a customer order by looking for 'co'.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sanitizes and sorts orders by normalized designCode, then by orderNo.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sanitizes and sorts orders by karigar name, then design code, then orderNo.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Validates PersistentOrder objects and filters invalid entries, returning valid orders and a skipped count.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Loads an XLSX file with JSZip and extracts embedded images from xl/media, assigning them to rows.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses a 3-column sheet and maps each row to its corresponding embedded image, validating required fields.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Reads master design data from the first Excel sheet using flexible column matching to produce design entries.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders with flexible column names, validates fields, handles optional weight/size, and collects warnings.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Ensures SheetJS is loaded, reads an Excel file into a workbook, and validates sheet presence.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Parses master design files by detecting PDF or Excel format and delegating to the appropriate parser.",
  "frontend/src/lib/parsers/orderParser.ts": "Routes uploaded files to PDF or Excel parsers, returning parsed orders and warnings with error handling.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads PDF.js dynamically and extracts structured text lines from each PDF page for downstream parsing.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses master design table rows from flattened PDF text into design-code-to-entry mappings.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses PDF order lines using table-row or section-header modes, producing PersistentOrder objects.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Attempts to parse a single PDF line as a structured order row containing karigar and numeric fields.",
  "frontend/src/main.tsx": "Initializes React, QueryClient, and Internet Identity provider before rendering the app.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for orders, master designs, and queued ingestions with CRUD helpers.",
  "frontend/src/offline/sync.ts": "Hook that uploads queued offline ingestion batches and updates sync state with progress and errors.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard for viewing, filtering, and bulk-updating orders across multiple tabs with dialogs for images, quantity edits, and metrics.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Page for uploading, parsing, validating, and saving design image mappings from Excel files.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Interface to view, search, add, import, and edit master design mappings and manage karigar lists.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin tool for creating users, managing approvals, and blocking or unblocking user accounts.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Karigar dashboard for viewing active orders, filtering them, requesting approval, and bulk-marking orders delivered.",
  "frontend/src/pages/LoginPage.tsx": "Renders the styled login screen with branding and an Internet Identity login button.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Setup page allowing entry of a bootstrap token to initialize the first admin and refresh session actors.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Handles uploading, parsing, mapping, previewing, and batch-uploading order files with progress, warnings, and error states.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Displays staff dashboard with order tabs, filters, metrics, and dialogs for editing and viewing designs.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Shows unmapped design codes, supports searching, grouping, and launching a form to add master design mappings.",
  "frontend/src/pwa/clearPwaCaches.ts": "Clears all browser caches and unregisters service workers to remove stale PWA assets.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, handles updates, forces activation, and reloads when a new worker takes control.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped-canister, network, or generic types and extracts safe diagnostic info.",
  "frontend/src/utils/errorPresentation.ts": "Produces user-friendly error messages using bootstrap classification and decodes technical error strings.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, persisting them in sessionStorage, and removing params from hash routing.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the operation exceeds the specified duration.",
  "frontend/src/version.ts": "Exports the build identifier constant for Version 54.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, plugins, and content paths.",
  "project_state.json": "Defines project metadata, known issues, and feature requests related to restoring and validating Version 54."
}