{
  "backend/main.mo": "Main Motoko actor defining persistent types (orders, karigars, designs, users, activity logs), state maps, authorization/storage mixins, and public API for order management, master design mappings, karigar CRUD, user profiles, image storage, and activity logging.",
  "feature_evidence.json": "Feature evidence report documenting four features: karigar mapping display fix across all tabs, mobile Safari viewport rendering fix, master design karigar auto-population from Excel, and removal of individual karigar tabs from Total Orders with a dedicated \"By Karigar\" tab.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files covering routing, hooks, components, pages, utilities, and state management with implementation details for role-based access, order management, karigar resolution, and offline sync.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tags configured for mobile (maximum-scale=1.0, user-scalable=no), PWA manifest link, and theme color for KarigarFlow application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode (standalone), theme colors, and start URL for KarigarFlow jewellery order management system.",
  "frontend/public/service-worker.js": "Service worker (v54) implementing cache-first strategy for static assets, network-first for navigation/HTML, cache cleanup on activation, skip waiting support, and offline fallback handling.",
  "frontend/src/App.tsx": "Root application component with role-based routing, authentication flow, bootstrap error handling, blocked user checks, profile setup modal for first admin, and keyed Outlet by pathname to force route component unmounting.",
  "frontend/src/components/admin/KarigarSummaryCards.tsx": "Displays a grid of cards summarizing orders by karigar (craftsperson), showing total orders and quantity per karigar with filtering and selection capabilities. Includes color-coded badges and handles unassigned orders.",
  "frontend/src/components/admin/MetricsChart.tsx": "Renders four metric cards displaying aggregated order statistics: total orders, total quantity, total weight, and customer orders count. Uses gradient-styled cards with icons for visual distinction.",
  "frontend/src/components/admin/TotalQtyBreakdownDialog.tsx": "Modal dialog that displays a breakdown of total quantities across different categories (delivered, hallmark, total orders, customer orders, karigars) with a grand total summary.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with an alert icon and a button to navigate back to the dashboard when users lack permissions for a page.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Full-screen component shown to blocked users, displaying a warning message and logout button with instructions to contact the administrator.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen displayed when user profile fails to load, showing error details with retry and logout options, plus backend status guidance.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button that handles both login and logout actions using Internet Identity, with loading states and PWA cache clearing on logout.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Screen shown to authenticated users without a profile, displaying their Principal ID with copy functionality and instructions to contact an administrator for profile creation.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first-time admin setup that prompts for name entry to complete the initial administrator profile configuration.",
  "frontend/src/components/auth/RoleGate.tsx": "Authorization wrapper component that checks user roles against allowed roles and displays access denied screen or loading state when appropriate.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Displays a table of design image mappings showing design code, generic name, image availability badge, and creation date. Shows a message when no mappings are found.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Modal dialog that fetches and displays a design image for a given design code, showing loading, error, and empty states. Manages blob URL lifecycle for the image.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches app-level errors and displays a friendly error UI with options to reload or logout/clear session. Includes PWA cache clearing on logout.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Reusable collapsible panel that displays technical error details with a copy-to-clipboard button. Shows raw error strings in a monospace format.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Alert component for displaying inline error messages with optional retry button and collapsible error details. Handles special stopped-canister error messages.",
  "frontend/src/components/exports/ExportActions.tsx": "Dropdown menu component providing export options for orders (CSV, PDF, JPEG) with support for all orders, customer orders only, daily sheets, and per-karigar exports. Handles export state and toast notifications.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Export dropdown for karigar-specific order views, offering PDF and JPEG exports for either daily orders or total orders. Filters orders by selected date and karigar name.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Card component with filter controls (all/date/design) and export buttons for PDF and JPEG formats. Displays filtered order count and handles export operations with loading states.",
  "frontend/src/components/karigar/AddKarigarDialog.tsx": "Dialog component for adding a new karigar with duplicate name detection (normalized for case/spacing). Includes form validation, mutation handling, and success callbacks.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Read-only dialog displaying detailed order information including design code, generic name, weight, size, quantity, status, remarks, and date. Includes a button to open the design image viewer.",
  "frontend/src/components/karigar/TotalKarigarListDialog.tsx": "Dialog showing a searchable, scrollable list of all karigars with loading/error states. Supports optional karigar selection callback and filters out empty names.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell with role-based navigation (Admin/Staff/Karigar), responsive mobile/desktop menus, connectivity status bar, backend status indicator, and user authentication display.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Form dialog for creating or editing master designs with design code, generic name, and karigar assignment. Includes confirmation dialog for karigar reassignment and triggers order updates when karigar changes.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog for bulk importing master designs from PDF or Excel files. Parses file, shows preview with create/update summary, validates karigar references, and saves to backend.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Displays a table of master designs with columns for design code, generic name, karigar name, and active status. Provides edit and toggle active/inactive actions for each design entry.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Renders a preview table for orders being ingested from files, highlighting unmapped design codes with warning icons and showing whether karigar assignments came from the PDF. Displays order details including type, quantities, weight, size, and remarks.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Displays a destructive alert banner when invalid orders are detected in local cache, showing the count of skipped orders and providing a button to clear cache and reload.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Provides a comprehensive filter bar for orders with search input, date range pickers, karigar and status dropdowns, customer order and RB-only checkboxes, and a clear filters button.",
  "frontend/src/components/orders/OrdersTable.tsx": "Displays a selectable table of orders with columns for order number, type, design code, karigar, quantities, status, and remarks. Supports bulk selection with checkbox column and applies status-based row coloring.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Modal dialog for specifying partial fulfillment quantities for RB orders, allowing users to input supplied quantities with validation against original order quantities. Includes error handling and scrollable list for multiple orders.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog component for editing the total supplied quantity of an RB order, with validation and mutation handling via useUpdateOrderTotalSupplied hook.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Compact header component displaying backend online/offline status with collapsible canister ID display and error details panel when offline.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Status bar showing network connectivity and offline sync queue status with manual sync trigger button.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor with identity-based authentication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Hook that periodically polls backend health check endpoint to determine online/offline status with error classification for stopped canisters.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Hook providing clipboard copy functionality with status tracking (idle/success/error) and user-friendly button labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Hook that fetches the current user's profile from the backend actor with error classification and authorization failure detection.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Hook that derives effective app role by combining user profile role with backend admin check, ensuring admins are always treated as Admin.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow and identity persistence with configurable AuthClient options.",
  "frontend/src/hooks/useOrdersCache.ts": "React hook that hydrates orders from IndexedDB on mount, merges cached and backend data, sanitizes invalid entries, and provides loading/error states with cache management functions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching orders, karigars, master designs, unmapped codes, and mutations for uploading/updating data with automatic cache invalidation.",
  "frontend/src/hooks/useSafeActor.ts": "React Query hook that creates an authenticated or anonymous actor with 15-second timeout, handles admin token initialization, and implements retry logic for non-retryable errors.",
  "frontend/src/index.css": "Tailwind CSS configuration with OKLCH color system for light/dark themes, z-index variables, vibrant gradient card utilities, and admin tab styling.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates printable HTML for karigar orders with iOS compatibility, creates formatted tables with order details, and triggers browser print dialog for PDF export.",
  "frontend/src/lib/exports/ordersExport.ts": "Exports orders to CSV format with filtering by type (all/karigar/customer/daily), formats data columns, and triggers browser download.",
  "frontend/src/lib/karigars/getKarigarColor.ts": "Provides deterministic color assignment for karigar names using hash-based selection from a predefined palette, with utility functions for card and badge CSS classes.",
  "frontend/src/lib/karigars/normalizeKarigarName.ts": "Normalizes karigar names by trimming whitespace, collapsing multiple spaces, and converting to lowercase for consistent comparison.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders by matching normalized design codes, preserving meaningful PDF-derived karigar IDs and treating empty/whitespace/\"Unassigned\" as missing. Returns mapped, unmapped, and preview orders.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming whitespace and collapsing repeated internal spaces to ensure consistent matching.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits an array of orders into batches of a specified size for processing.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Calculates order metrics (total orders, quantity, weight, customer orders) grouped by karigar, excluding orders with 'given_to_hallmark' status.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats karigar names for display, returning \"Unassigned\" for empty or whitespace-only values.",
  "frontend/src/lib/orders/formatOptionalNumber.ts": "Formats optional numeric fields (weight, size) to fixed decimals, returning empty string for null/undefined/NaN values.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Generates deterministic PO codes from karigar names using first 3 uppercase letters plus \"01\" (e.g., \"Momin\" → \"MOM01\").",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Extracts order timestamp as a Date object, preferring uploadDate over createdAt and converting from nanoseconds to milliseconds.",
  "frontend/src/lib/orders/getStatusRowColor.ts": "Maps normalized order status strings to Tailwind CSS background color classes for visual differentiation.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Checks if an order type is a customer order by testing if it contains 'co' (case-insensitive).",
  "frontend/src/lib/orders/isTodayOrder.ts": "Determines if an order has activity today by checking if creation timestamp or lastStatusChange falls within today's date range.",
  "frontend/src/lib/orders/normalizeStatus.ts": "Normalizes status strings by trimming, lowercasing, and collapsing repeated spaces for consistent comparison.",
  "frontend/src/lib/orders/resolveKarigarName.ts": "Resolves karigar name from ID by looking up in karigars list, returning \"Unassigned\" for empty/null/undefined or missing entries.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts orders by normalized design code (primary) and order number (secondary) after sanitizing for validity.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sorts orders by formatted karigar name, then normalized design code, then order number after sanitizing for validity.",
  "frontend/src/lib/orders/statusConstants.ts": "Defines order status constants, types, and display labels for consistent status handling across the application.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Provides type guard and sanitization function to validate PersistentOrder objects have required fields, filtering out invalid entries.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Extracts embedded images from Excel files by unzipping the .xlsx archive and reading files from the xl/media/ folder using JSZip.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses Excel workbook with exactly 3 columns (Sl no, Design code, Image) and extracts embedded images, validating each row and associating images by row position.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design mappings from Excel workbooks with flexible column name matching (Design Code, Generic Name, Karigar/Factory Name). Normalizes headers, validates required columns, and returns tuples of design codes with their master design entries.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from Excel workbooks with flexible column matching, validates numeric fields (weight/size are optional), detects customer orders, and returns orders with row-level warnings for invalid data.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Dynamically loads SheetJS library from CDN if needed, reads Excel files (.xlsx/.xls) as ArrayBuffer, and returns a SheetJS workbook object with validation and error handling.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Main entry point for parsing master design files, routing to PDF or Excel parsers based on file extension, with unified error handling and user-friendly messages.",
  "frontend/src/lib/parsers/orderParser.ts": "Main entry point for parsing order files, routing to PDF or Excel parsers based on file extension, returning both parsed orders and non-blocking warnings with comprehensive error handling.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Dynamically loads pdfjs-dist from CDN, extracts text from PDF files page-by-page, groups text items by Y-position to preserve line structure, and returns an array of pages with line arrays for tabular parsing.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses master design mappings from extracted PDF text by finding header rows and parsing whitespace-separated tokens into design code, generic name, and karigar name fields.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text using dual-mode parsing: first attempts table-row format with explicit Karigar column, then falls back to section-header format where karigar names are section headers. Returns array of PersistentOrder objects with validation.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single PDF line in table format with explicit Karigar column, extracting order details (orderNo, type, design, weight, size, qty) and karigar name from the last token. Returns PersistentOrder or null if validation fails.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/offline/db.ts": "IndexedDB wrapper providing offline storage for orders, master designs, sync queue, and metadata with functions for caching, retrieving, clearing, and queuing data for later synchronization.",
  "frontend/src/offline/sync.ts": "Implements offline sync functionality using a queue-based approach to upload cached orders when online, with sync state tracking (isSyncing, queueCount, lastSyncTime, error) and automatic query invalidation after successful sync.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main admin dashboard with tabbed interface (today, delivered, hallmark, total, customer, karigars) showing filtered order tables, karigar summaries, metrics charts, and bulk actions for order status updates and hallmark returns with touch gesture support for tab navigation.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Admin page for uploading and managing design image mappings from Excel files, with parsing preview, validation feedback, and batch save functionality to store design code to image associations.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Admin page for managing master designs with search, filtering by karigar, and dialogs for adding, editing, and importing designs. Displays a table of master designs with their codes, generic names, and associated karigars.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin page for user management that allows creating new users with roles, approving/rejecting user requests, and blocking/unblocking users. Displays tables of user profiles and pending approvals.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Dashboard for karigar users showing their active orders with metrics (total orders, quantity, weight). Features tabs for filtering by karigar and bulk marking orders as delivered.",
  "frontend/src/pages/LoginPage.tsx": "Login page component displaying KarigarFlow branding with gem icon and LoginButton, styled with background pattern and card layout for authentication entry point.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "One-time setup page for initializing the first administrator by entering a bootstrap token. Stores the token in session parameters and redirects to home on success.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Staff page for uploading and ingesting order files with date selection, parsing preview, and master design mapping. Shows mapped/unmapped orders and handles batch upload with progress tracking.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Staff dashboard displaying orders across multiple tabs (today, total, hallmark, customer) with per-tab filtering by date, karigar, status, and order type. Includes metrics cards and export functionality.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Staff page that displays design codes from orders that haven't been mapped to master designs, with search functionality and a button to add each code to a master design via a dialog.",
  "frontend/src/pwa/clearPwaCaches.ts": "Utility function to clear all browser cache storage entries and unregister service workers for PWA cleanup after rollback.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates every minute, and automatically activates new service workers by sending SKIP_WAITING message and reloading the page.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped-canister or network errors, extracts canister IDs from error messages, and provides user-friendly diagnostic messages.",
  "frontend/src/utils/errorPresentation.ts": "Presents errors to users with friendly messages by decoding URL-encoded errors, classifying them using bootstrap classification, and extracting meaningful messages from backend errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the promise doesn't resolve within the specified duration.",
  "frontend/src/version.ts": "Exports a build identifier constant set to 'v54' for version rollback tracking.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors (using CSS variables), z-index layers, animations, and plugins for animate and typography.",
  "project_state.json": "Project state file tracking an admin dashboard application for managing karigars (workers), orders, and design codes with Excel import functionality. Documents four known issues requiring fixes: karigar mapping display across tabs, mobile Safari 50% zoom rendering, karigar name auto-population from Excel, and karigar tab names appearing incorrectly in total orders tab."
}