{
  "backend/main.mo": "Main Motoko canister defining health check, authorization mixin, user approval, data models, and maps for designs and orders.",
  "feature_evidence.json": "Feature evidence report describing a parser update for Master Designs Excel import and related metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference or build documentation.",
  "frontend/index.css": "Tailwind CSS configuration defining light/dark theme variables and base styles.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, theme, icons, and startup configuration.",
  "frontend/public/service-worker.js": "Service worker handling asset caching, fetch interception, and cache cleanup.",
  "frontend/src/App.tsx": "Main React router layout handling authentication, bootstrap flow, error states, and route definitions.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Component showing an access denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen displayed when bootstrap fails, offering retry, logout, and error detail display.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and cache clearing.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Displays a screen for authenticated users without profiles, showing their principal ID with copy support and instructions to contact an administrator.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for initial admin setup allowing the first user to enter their name and trigger profile creation.",
  "frontend/src/components/auth/RoleGate.tsx": "Wraps protected content and only renders children if the current user's role is allowed; otherwise shows an access denied screen.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Global error boundary that shows a friendly error screen with technical details and options to reload or clear session.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel displaying raw technical error details with a copy-to-clipboard action.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error component showing a message, optional retry button, and expandable technical details.",
  "frontend/src/components/exports/ExportActions.tsx": "Provides a dropdown menu to export order data in multiple formats using the ordersExport utility.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with role-based navigation, responsive mobile menu, and status indicators.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Dialog for adding or editing master design mappings, handling form state and saving via mutation.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog component that handles selecting, parsing, previewing, and importing master design files, showing created/updated counts and errors.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Displays a table of master designs with edit and activation toggles, calling mutations to update active status.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Shows a preview of ingested orders with unmapped design detection, karigar validation, and order details.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Filter bar for orders allowing karigar, date range, CO-only, and status filtering with clear/reset behavior.",
  "frontend/src/components/orders/OrdersTable.tsx": "Renders a detailed orders table with optional status update controls and formatted order fields.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Compact indicator showing backend reachability status, canister ID, refresh control, and expandable error/details panel.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Displays online/offline status and pending sync count, offering a manual sync button when online.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to the current identity, reinitializing and invalidating queries when the identity changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs backend health checks using a safe actor and classifies errors to determine online/offline status.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy functionality with status tracking and dynamic button labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile via a safe actor, handling auth errors and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading through context.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for orders, master designs, unmapped codes, and related mutations using a safe actor.",
  "frontend/src/hooks/useSafeActor.ts": "Creates an actor with timeout and safe initialization logic, handling identity changes and non-retryable errors.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters orders by type, converts them to CSV, and triggers a download with a type-based filename.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Maps orders to master designs using normalized codes, preserving existing karigar names and returning mapped and unmapped results.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace for consistent matching.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate order metrics including totals and karigar-wise breakdowns.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats a karigar name, returning 'Unassigned' when empty or whitespace.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Determines if an order type indicates a customer order by checking for 'co'.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts orders by normalized design code and then by order number.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design mappings from an Excel workbook using flexible header matching.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from an Excel workbook with strict required columns and validation.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads SheetJS if needed and reads an Excel file into a validated workbook.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Parses master design files, routing to PDF or Excel parsers with error handling.",
  "frontend/src/lib/parsers/orderParser.ts": "Parses order files from PDF or Excel using corresponding extractors and parsers.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads PDF.js from CDN and extracts page text into structured lines by grouping text items by coordinates.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses flattened PDF text lines to extract master design entries by identifying headers and splitting rows into design fields.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text using either table-row format or section-header format, building Order objects with timestamps.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Attempts to parse a single PDF line as a structured order row with explicit karigar column and validated numeric fields.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for orders, master designs, sync queue, and metadata with basic CRUD helpers.",
  "frontend/src/offline/sync.ts": "React hook that syncs queued offline ingestions to backend, updates metadata, and invalidates queries.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin order metrics filtered by date, handles loading and error states, and shows detailed orders with export actions.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Fetches and filters master design mappings, provides search, add, import, and edit capabilities, and displays results in a table.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Allows admins to create user profiles by entering principal IDs and role details with validation and error handling.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Shows a karigar's assigned orders with derived metrics and a table supporting status updates.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding, background pattern, and Internet Identity login button.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Initializes the first admin user via a bootstrap token and triggers actor reinitialization before redirecting.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Parses uploaded order files, applies master design mappings, previews mapped/unmapped orders, and uploads parsed orders with error handling.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Dashboard page that loads orders, applies filters and sorting, and displays them with export and upload actions.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Displays unmapped design codes grouped by code with search and a dialog to add master design mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load and logs success or failure.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped-canister, network, or generic types and extracts safe error details.",
  "frontend/src/utils/errorPresentation.ts": "Converts errors into user-friendly messages using bootstrap error classification and safe string extraction.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters via query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it exceeds the specified duration.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Tracks project state, issues, and feature requests related to Excel import header handling and backend canister reliability."
}