{
  "backend/main.mo": "Defines the main canister with order, design, user, access control, storage, and activity log types and maps, plus validation helpers and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing features, related frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their roles and behaviors in the app.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying base styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, icons, theme colors, and startup behavior.",
  "frontend/public/service-worker.js": "Service worker implementing caching strategies for assets and navigation with install, fetch, and activate handlers.",
  "frontend/src/App.tsx": "Top-level app routing and bootstrap logic handling authentication, role checks, profile loading, and error screens.",
  "frontend/src/components/admin/TotalQtyBreakdownDialog.tsx": "Dialog component showing a breakdown of various quantity metrics with a computed grand total.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Shows a blocked account message and allows the user to log out and clear session data.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Handles profile loading errors with retry and logout options, showing detailed error info when available.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button that integrates with Internet Identity and handles login edge cases.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Informs authenticated users without a profile and provides tools to copy their principal ID and refresh.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for initial admin setup allowing the first user to submit their name and initialize their profile.",
  "frontend/src/components/auth/RoleGate.tsx": "Wraps content with role-based access control and shows loading or denial screens when appropriate.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Renders a table of design image mappings with design codes, names, and creation dates.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Dialog for loading and displaying a design image with error and loading states.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Global error boundary that shows a fallback screen with error details, reload, and logout actions.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel showing technical error details with a copy-to-clipboard button.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Displays an inline error alert with optional retry and detailed error panel, handling stopped-canister messages.",
  "frontend/src/components/exports/ExportActions.tsx": "Provides a dropdown to export orders in CSV or per-karigar PDF/JPEG formats with filtering and toast notifications.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Adds export options for a single karigar's daily or total orders in PDF or JPEG formats.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "Offers UI controls to filter orders by date or design and trigger PDF/JPEG exports using a provided callback.",
  "frontend/src/components/karigar/AddKarigarDialog.tsx": "Dialog for adding a new karigar via mutation with validation and toast feedback.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Shows detailed karigar order info with image viewer access inside a dialog.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell rendering role-based navigation and layout structure with mobile and desktop menus.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Form dialog for adding or editing a master design, handling validation, karigar lookup, and save mutations.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog for uploading, parsing, previewing, and importing master design files with error handling and summary reporting.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Table displaying master design mappings with edit and activate/deactivate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Preview table for ingested orders showing mapping status, order details, and PDF-derived indicators.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Banner warning about skipped or invalid cached orders with an option to clear local cache.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Filter bar for orders list supporting karigar, status, date range, CO/RB flags, and optional order number search.",
  "frontend/src/components/orders/OrdersTable.tsx": "Renders a selectable orders table with actions, RB edit controls, and row highlighting after sanitizing input orders.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog for entering partial supplied quantities per order with validation and confirmation callback.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Modal for editing an RB order’s total supplied quantity with validation and mutation update.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Header indicator showing backend online/offline status, refresh controls, and optional canister ID display.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Status bar reflecting online/offline state and pending offline sync queue with manual sync trigger.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs backend health checks, classifies errors, and exposes online/offline status with refetch control.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy helper with status tracking and user-facing status labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile via a safe actor with error handling and exposes loading and resolved profile state.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Computes the user's effective app role by combining their profile role with an admin backend check.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, manages AuthClient lifecycle, and exposes identity, login, and logout state.",
  "frontend/src/hooks/useOrdersCache.ts": "Hydrates orders from IndexedDB, merges with backend data, sanitizes invalid entries, and manages loading and cache clearing.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend resources like orders, designs, and activity logs.",
  "frontend/src/hooks/useSafeActor.ts": "Safely creates an authenticated or anonymous backend actor with timeout, optional admin initialization, and retry rules.",
  "frontend/src/index.css": "Configures global Tailwind styles, theme variables, dark mode overrides, and admin dashboard tab components.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates a printable HTML/PDF export of karigar orders with totals, table formatting, and iOS-safe print handling.",
  "frontend/src/lib/exports/ordersExport.ts": "Exports filtered orders as a CSV file, supporting daily, karigar-wise, customer-order, and full exports with sorting.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders, filling generic and karigar names and tracking mapped and unmapped entries.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace for consistent comparisons.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits an order list into fixed-size batches.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes totals and karigar-wise statistics from sanitized orders.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Trims karigar names and substitutes 'Unassigned' when empty.",
  "frontend/src/lib/orders/formatOptionalNumber.ts": "Formats optional numeric fields with fixed decimals or returns empty strings.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Creates a deterministic PO code from a karigar name using its first three letters.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Returns an order timestamp, preferring uploadDate and converting nanoseconds to milliseconds.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Detects customer orders by checking if the type contains 'co'.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts sanitized orders by normalized design code and then order number.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sorts sanitized orders by formatted karigar name, then design code, then order number.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Validates and filters PersistentOrder objects, removing invalid entries.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Extracts embedded images from XLSX files using JSZip, assigning them to rows sequentially.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses a 3-column Excel sheet and matches each row with an embedded image to produce design-image mappings.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design mappings from a SheetJS workbook, normalizing headers and extracting design code, generic name, and karigar name.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Extracts orders from an Excel workbook with flexible column matching, numeric validation, and row-level warnings and errors.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads the SheetJS library if needed and reads an Excel file into a validated workbook object.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Routes master design file parsing to either the Excel or PDF parser with error handling.",
  "frontend/src/lib/parsers/orderParser.ts": "Selects the correct parser for orders based on file type and returns parsed orders plus warnings.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads PDF.js from CDN and extracts structured text lines from each page of a PDF.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses master design entries from extracted PDF text by locating headers and splitting rows into design, generic name, and karigar name.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text using table-row or section-header formats, maintaining karigar context and validating fields.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a PDF table row into a PersistentOrder, extracting fields with validation. Returns a fully populated order object or null on format errors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/offline/db.ts": "Implements an IndexedDB wrapper for caching orders, master designs, and queued sync batches. Provides CRUD helpers for offline storage and ingestion queueing.",
  "frontend/src/offline/sync.ts": "React hook that uploads queued offline orders in batches and updates sync status. Handles retries, progress logging, and cache invalidation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing orders with filters, tabs, metrics, and bulk actions. Integrates data fetching, caching, and dialogs for editing and viewing orders.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "UI for uploading, parsing, validating, and saving design image mappings. Supports Excel parsing and saving mappings to the backend.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Manages master design mappings with search, add, edit, and import actions. Displays designs in a table and supports adding karigars.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Provides UI for admins to create users, manage approvals, and block or unblock accounts using query hooks.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Shows karigar orders with filtering, approval handling, cache management, and bulk delivery actions.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding and an Internet Identity login button.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Initializes the first admin by storing a bootstrap token and refreshing actor queries.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Handles file-based order ingestion, parsing, master design mapping, previews, and batched uploads.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Displays staff dashboards with tabbed order views, filters, activity logs, and editing dialogs.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Lists unmapped design codes with search and provides a dialog to add new master design mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates periodically, and logs lifecycle events.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors such as stopped canister or network issues and extracts safe diagnostic details.",
  "frontend/src/utils/errorPresentation.ts": "Generates user-friendly error messages using bootstrap classifications and decoding logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the operation exceeds a specified duration.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Describes the project state, known issues, and existing feature requirements for Master Design Admin."
}