{
  "backend/main.mo": "Defines the backend actor with health check, authorization mixin, user approval state, data models, and comparison utilities for designs and orders.",
  "feature_evidence.json": "Describes feature evidence for PDF order parsing and ingestion preview updates, including affected files and components.",
  "frontend-file-summaries.txt": "Lists short summaries of key frontend files covering routing, hooks, dashboards, ingestion flow, and error handling.",
  "frontend/index.css": "Tailwind base/theme variables for light and dark modes with custom design tokens.",
  "frontend/index.html": "Base HTML entry point loading the main React application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, and icons.",
  "frontend/public/service-worker.js": "Service worker handling caching, fetch interception, and cache cleanup for offline support.",
  "frontend/src/App.tsx": "Main React app router and bootstrap logic with authentication, profile loading, timeout watchdog, and error handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when the user lacks permission to access a route.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen for failed bootstrap with retry and logout actions plus detailed error info.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with state handling and query cache clearing.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Displays a screen for authenticated users without a profile, showing their principal ID and copy/refresh options.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first-time admin users to enter their name and complete initial profile setup.",
  "frontend/src/components/auth/RoleGate.tsx": "Restricts access to children components based on allowed user roles, showing an access-denied screen otherwise.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Global React error boundary that shows a friendly error screen with reload and logout options.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel showing technical error details with a copy-to-clipboard option.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert displaying a message, optional retry button, and detailed technical error info.",
  "frontend/src/components/exports/ExportActions.tsx": "Provides a dropdown menu to export orders in various formats using exportOrders.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell with role‑based navigation, mobile menu, and status indicators.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Dialog for adding or editing master design mappings, handling form submission and validation.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog for uploading and parsing master design files, showing results and importing parsed entries.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Displays master designs in a table with edit and activate/deactivate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Renders a preview of ingested orders, highlighting unmapped design codes and key order fields.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Provides filter controls for orders including karigar, date range, CO flag, and status.",
  "frontend/src/components/orders/OrdersTable.tsx": "Shows detailed order rows with optional status update selector and customer‑order highlighting.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Header indicator showing backend online/offline state with refresh, error details, and canister ID display.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Displays online/offline status and pending sync info, offering a manual sync button when online with queued uploads.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous backend actor and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically performs backend health checks, classifying errors and exposing reachability status and health data.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy functionality with status tracking and dynamic button labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile via a safe actor, handling auth errors and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading identities and providing login/clear actions.",
  "frontend/src/hooks/useQueries.ts": "Collection of data-fetching and mutation hooks for orders, master designs, and unmapped codes using the safe actor.",
  "frontend/src/hooks/useSafeActor.ts": "Safely creates a backend actor with timeout and optional access-control setup, exposing status and errors.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme CSS variables and global element styling.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters orders by type and exports them as a downloadable CSV using dynamically generated filenames.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Maps orders to master design entries using normalized design codes and fills missing fields while tracking unmapped items.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming whitespace and collapsing internal spaces.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate order metrics including totals and karigar-wise breakdowns.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats karigar names, returning 'Unassigned' when empty.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Determines if an order type represents a customer order based on substring matching.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts orders by normalized design code and then by order number.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design entries from an Excel workbook with flexible header handling and validation.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from an Excel workbook, validating required columns and converting rows into Order objects.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads the XLSX library if needed and reads an uploaded Excel file into a SheetJS workbook.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Dispatches master design parsing to PDF or Excel handlers and returns parsed design mappings.",
  "frontend/src/lib/parsers/orderParser.ts": "Parses order files from PDF or Excel, delegating to format-specific parsers and returning Order objects.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads PDF.js from CDN and extracts structured text lines from each PDF page.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses design code entries from extracted PDF lines using header detection and row splitting.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text, tracking karigar headers and converting lines into Order objects.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/offline/db.ts": "Defines IndexedDB storage for offline orders, master designs, sync queue, and metadata.",
  "frontend/src/offline/sync.ts": "React hook that syncs queued offline ingestions to backend and updates cache state.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing orders, metrics, date filtering, tables, and export options.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Displays master design mappings with search, add, import, and edit functionality using dialogs and a table.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Provides a form to create user profiles with validation, role selection, and error handling for canister issues.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Shows karigar-specific metrics and assigned orders, handling loading, error states, and sorted order display.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding and an Internet Identity login button.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Handles one-time admin initialization via a bootstrap token and triggers actor reinitialization before redirecting.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Parses uploaded order files, applies master design mappings, previews results, and uploads mapped and unmapped orders with error handling.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Displays all orders with filtering, sorting, exporting, and an option to navigate to the order ingestion workflow.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "React page listing unmapped design codes, supporting search, grouping, and opening a form dialog to add mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load and logs success or failure.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped-canister, network, or generic categories and extracts safe error details.",
  "frontend/src/utils/errorPresentation.ts": "Transforms errors into user-friendly messages using bootstrap classification and exposes helpers for stopped-canister messaging.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence and hash-routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting with a timeout error if it exceeds the specified duration.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, plugins, and styling tokens.",
  "project_state.json": "Project state file describing system goals, architecture notes, issues, and existing features for build planning."
}