{
  "backend/main.mo": "Motoko canister defining health check, authorization mixin, user profiles, master design mapping, orders, and comparison utilities.",
  "feature_evidence.json": "Feature evidence report listing two features, related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their functionality for reference.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and base styles.",
  "frontend/index.html": "Basic HTML shell loading the root React app via main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and launch behavior.",
  "frontend/public/service-worker.js": "Simple service worker implementing install, fetch cache, and cache cleanup for offline support.",
  "frontend/src/App.tsx": "Main React app router and bootstrap logic with authentication, profile loading, admin checks, and timeout handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks permission to access a page.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Error screen shown when profile or bootstrap loading fails, with retry and logout actions.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity and handles auth state and errors.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Displays a pending-access screen for authenticated users without a profile and allows copying their principal ID.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Admin-only modal for initial setup that saves the admin's name and refreshes related queries.",
  "frontend/src/components/auth/RoleGate.tsx": "Restricts content to users with allowed roles and shows a loading spinner or access denied as needed.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Catches application errors and shows a recovery UI with reload and logout options.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel displaying technical error details with a copy-to-clipboard option.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error block with optional retry action and expandable technical details.",
  "frontend/src/components/exports/ExportActions.tsx": "Dropdown for exporting orders in various structured formats.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with role-based navigation, mobile menu, and connectivity indicators.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Dialog for adding or editing master design mappings and saving them via mutation.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog component that handles file selection, parsing, summary calculation, and importing of master design entries.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Displays a table of master designs with edit and activate/deactivate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Renders a preview table of ingested orders, highlighting unmapped design codes and missing karigar names.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Provides filter controls for orders, including karigar, date range, CO-only, and status filters.",
  "frontend/src/components/orders/OrdersTable.tsx": "Shows a detailed orders table with optional status update controls and customer order highlighting.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Displays backend reachability status with refresh, error details, and optional canister ID reveal/copy.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Displays online/offline status and queued sync count, offering manual sync when online.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs a backend health check and classifies errors to determine online/offline status.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Provides clipboard copy function with temporary success/error status labels.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile using a safe actor and handles auth and bootstrap errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth client, login flow, stored identities, and related status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on orders, master designs, and unmapped codes using a safe actor.",
  "frontend/src/hooks/useSafeActor.ts": "Builds an authenticated or anonymous actor with timeout and safe access-control initialization, caching it indefinitely.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/exports/ordersExport.ts": "Exports orders to CSV, filtering by type and generating a downloadable file.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Maps orders to master design entries using normalized codes and preserves meaningful karigar names.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate order metrics including totals and karigar-wise breakdowns.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats karigar names, returning 'Unassigned' for empty values.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Detects customer orders by checking if the order type contains 'co'.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts orders by normalized design code and then by order number.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design mappings from an Excel workbook using flexible column matching.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses order rows from an Excel workbook, validating required fields and converting types.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads SheetJS if needed and reads an Excel file into a workbook object with error handling.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Parses master design files from PDF or Excel, delegating to format-specific parsers.",
  "frontend/src/lib/parsers/orderParser.ts": "Parses order files from PDF or Excel, routing to the appropriate parser based on file type.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads PDF.js from CDN and extracts structured text lines from each PDF page.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses flattened PDF text lines into master design entries by detecting headers and splitting row data.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses order rows from PDF text while tracking karigar/factory headers and constructing Order objects.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for orders, master designs, sync queue, and metadata.",
  "frontend/src/offline/sync.ts": "React hook that syncs queued offline ingestions with the backend and updates local query cache.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard that displays orders, metrics, date filtering, and error/loading states.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Displays master design mappings with search, add, import, and edit functionality using dialogs and a table.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Provides a form to create user profiles by principal ID with validation, role selection, and error handling.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Shows a karigar's assigned orders with summary metrics and a table, using derived metrics and sorted data.",
  "frontend/src/pages/LoginPage.tsx": "UI page rendering the login screen with branding and a sign‑in button.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "Handles initial admin bootstrap by accepting a token, storing it, reinitializing actors, and redirecting.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Allows staff to upload and parse order files, apply master design mappings, preview results, and handle mapping or parse errors.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Enables staff to view, filter, sort, export, and navigate to ingest orders, displaying all orders in a table.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "React page that lists unmapped design codes grouped from fetched orders, supports searching, and opens a form dialog to add mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs success or failure.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies errors into stopped-canister, network, or generic types and extracts canister IDs for diagnostics.",
  "frontend/src/utils/errorPresentation.ts": "Generates user-friendly error messages using bootstrap error classification and provides helpers for stopped-canister errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it exceeds a specified duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, plugins, colors, fonts, animations, and container settings.",
  "project_state.json": "Tracks overall project state, architecture notes, issues, and features for the KarigarFlow system."
}