{
  "backend/main.mo": "Main canister actor defining order, user, and design data types, authorization helpers, state maps, and basic query methods such as healthCheck and user profile access.",
  "backend/migration.mo": "Migration module exposing OldActor and NewActor structures and a run function that forwards old state unchanged to the new canister version.",
  "feature_evidence.json": "Feature evidence report mapping a hallmark‑update feature to affected frontend file and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "Basic HTML entry point that mounts the React application and loads main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest declaring app metadata, theme colors, start URL, and icons.",
  "frontend/public/service-worker.js": "Service worker implementing install, fetch, and activate handlers with cache strategies for offline support.",
  "frontend/src/App.tsx": "Top‑level React router and bootstrap logic handling authentication, profile loading, admin checks, and routing to dashboards.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks permissions, offering messaging and a button to return to the dashboard.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Displays a full-page error screen when profile loading fails, showing a retry option, logout, and technical details.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button that handles Internet Identity authentication and clears query cache on logout.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Shows a screen for authenticated users without a profile, including principal ID copy support and admin instructions.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Provides an admin‑only modal for initial profile setup, allowing the first user to enter a name and trigger profile creation.",
  "frontend/src/components/auth/RoleGate.tsx": "Guards children by required roles, showing loading or access‑denied states based on effective user role.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "A React error boundary that shows a fallback UI with error details and options to reload or clear session.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel showing technical error details with a copy‑to‑clipboard action.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert component with optional retry and technical details panel.",
  "frontend/src/components/exports/ExportActions.tsx": "Dropdown menu for exporting orders in various formats, including CSV and per‑karigar PDF/JPEG exports.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Provides an export dropdown for karigar orders, allowing PDF or JPEG export for daily or total orders with status handling and toasts.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app shell with role-based navigation, mobile/desktop menus, and header layout.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Dialog form for adding or editing a master design mapping with validation and save mutation.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog for importing master designs from a file, including parsing, previewing, and saving results with summary feedback.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Displays a table of master designs with edit and activate/deactivate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Shows a scrollable preview of ingested orders, highlighting unmapped designs and indicating PDF-assigned karigar names.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "UI bar providing filters for karigar, status, dates, and CO-only flag, with controlled state and reset handling.",
  "frontend/src/components/orders/OrdersTable.tsx": "Displays orders in a table with optional row selection, badges, and formatting helpers.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "Shows backend reachability state with refresh, canister ID display, and error details.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Displays online/offline status and pending offline sync queue with manual sync option.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs backend health checks and classifies errors to expose online/offline status.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Clipboard-copy helper hook with success/error state and status text.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the caller's user profile with error classification and controlled retry behavior.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Derives the effective user role by combining profile role with backend admin check.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useOrdersCache.ts": "Hydrates orders from IndexedDB, merges them with backend results, persists updates, and exposes loading and error states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating orders and related data, including IndexedDB persistence and batched uploads.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor with identity-aware initialization and timeout handling, exposing fetch state via React Query.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates and prints a formatted PDF of Karigar orders using an iframe-based print workflow.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters orders by type and exports them as a downloadable CSV file.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders, producing mapped, unmapped, and preview results with normalized design codes.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Trims a design code and collapses internal whitespace for consistent comparisons.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits an array of orders into batches of a specified size.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate order metrics and per‑karigar statistics from a list of orders.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Trims a karigar name and returns 'Unassigned' if empty.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Generates a deterministic PO code from a karigar name using the first three letters plus '01'.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Returns a Date derived from an order’s uploadDate or createdAt nanosecond timestamp.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Checks if an order type string indicates a customer order by looking for 'co'.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sorts orders by normalized design code, then by order number.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sorts orders by formatted karigar name, then normalized design code, then order number.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design mappings from an Excel workbook using flexible header matching and row extraction.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from an Excel workbook with flexible column matching, validation, and detailed row‑level errors.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Loads SheetJS from CDN if needed and reads an Excel file into a workbook object.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Routes master‑design file parsing to Excel or PDF handlers with error handling.",
  "frontend/src/lib/parsers/orderParser.ts": "Parses order files by routing to PDF or Excel parsers with unified error handling.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads pdfjs from CDN and extracts structured text lines from each PDF page using grouped Y positions.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses flattened PDF text lines to extract master design rows by locating a header and splitting lines into design code, generic name, and karigar.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text using either table-row or section-header format, producing timestamped PersistentOrder objects.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single PDF line in table-row format into a validated PersistentOrder with extracted generic and karigar names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, rendering the root App component.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for orders, master designs, queued ingestions, and sync metadata with helper CRUD functions.",
  "frontend/src/offline/sync.ts": "React hook that uploads queued offline orders, updates sync state, handles errors, and refreshes related queries.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard that loads orders, filters and sorts them by date and criteria, and supports bulk status updates and exports.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Displays and manages master design mappings with search, add, edit, and import capabilities.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Provides UI to create user profiles and list existing users with validation and role handling.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Karigar-facing dashboard showing active orders, metrics, and bulk delivery updates with profile validation.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login UI with branding and a button to authenticate via Internet Identity.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "One-time admin bootstrap page for submitting a token to initialize the first admin account.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Order ingestion workflow handling file parsing, master design mapping, previews, and batched uploads with progress tracking.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Dashboard for staff to view, filter, and bulk-update orders, including special hallmark views and date-based filtering.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Displays unmapped design codes grouped by code with search and a dialog to add master design mappings.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates periodically, and logs lifecycle events.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped-canister or network issues and extracts canister IDs for diagnostics.",
  "frontend/src/utils/errorPresentation.ts": "Generates user-friendly error messages using bootstrap error classification and simple keyword heuristics.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it exceeds the specified duration.",
  "frontend/tailwind.config.js": "Tailwind configuration defining themes, colors, animations, plugins, and custom design tokens.",
  "project_state.json": "Defines the project’s current state, known issues, and pending feature requests related to hallmark status updates and staff order fetching."
}