{
  "backend/main.mo": "Defines the main canister actor with all persistent types, maps, authorization mixins, and helper validation/role-checking functions for orders, designs, users, and images.",
  "feature_evidence.json": "Feature evidence report mapping feature fixes to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend components, hooks, and pages and their behaviors or architectural roles.",
  "frontend/index.css": "Tailwind base/theme variables for light and dark mode plus global styling for background, text, and borders.",
  "frontend/index.html": "Basic HTML shell with root div and script entry for the React application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining name, icons, colors, start URL, and display mode.",
  "frontend/public/service-worker.js": "Service worker handling caching strategy, versioned cache, offline fallback, skipWaiting, and cache cleanup.",
  "frontend/src/App.tsx": "Root React router setup with authentication bootstrap, role checks, error boundaries, and layout routing for all major pages.",
  "frontend/src/components/admin/KarigarSummaryCards.tsx": "Computes karigar order stats and displays selectable summary cards with counts and quantities.",
  "frontend/src/components/admin/TotalQtyBreakdownDialog.tsx": "Dialog showing total quantity breakdown with a grand total and per‑category values.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access‑denied message with a button to return to the dashboard.",
  "frontend/src/components/auth/BlockedUserScreen.tsx": "Displays a blocked‑account warning and provides a logout action.",
  "frontend/src/components/auth/BootstrapErrorScreen.tsx": "Shows profile‑loading errors with retry, logout, and optional error details.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and PWA cache clearing.",
  "frontend/src/components/auth/NoProfileBlockedScreen.tsx": "Informs authenticated users without profiles and lets them copy their principal ID.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Admin-only modal for initial profile setup that saves the admin’s name.",
  "frontend/src/components/auth/RoleGate.tsx": "Gate component that restricts children rendering based on allowed roles.",
  "frontend/src/components/designImages/DesignImageMappingsTable.tsx": "Table rendering design image mappings with codes, names, and creation dates.",
  "frontend/src/components/designImages/DesignImageViewerDialog.tsx": "Dialog that loads and displays a design image by code, handling loading, errors, and blob URL cleanup.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Global React error boundary that shows an error UI, technical details, and options to reload or clear session.",
  "frontend/src/components/errors/ErrorDetailsPanel.tsx": "Collapsible panel that reveals technical error details and allows copying them to clipboard.",
  "frontend/src/components/errors/InlineErrorState.tsx": "Inline error alert showing a message, optional technical details, and an optional retry button.",
  "frontend/src/components/exports/ExportActions.tsx": "Dropdown export menu for CSV and karigar-specific PDF/JPEG exports, filtering orders and handling export flows.",
  "frontend/src/components/exports/KarigarDrilldownExportBar.tsx": "Export bar for a single karigar enabling PDF/JPEG export of daily or total orders.",
  "frontend/src/components/exports/KarigarExportControls.tsx": "UI card allowing users to filter orders by date or design and export them as PDF or JPEG.",
  "frontend/src/components/karigar/AddKarigarDialog.tsx": "Dialog to create a new karigar with duplicate-name validation and mutation handling.",
  "frontend/src/components/karigar/KarigarOrderViewDialog.tsx": "Dialog showing detailed order info for a karigar, including metadata and a button to view design images.",
  "frontend/src/components/karigar/TotalKarigarListDialog.tsx": "Dialog listing all karigars with search, loading/error states, and selection callback support.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level application shell rendering role-based navigation, header, and layout structure with mobile/desktop menus.",
  "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx": "Form dialog to create or edit a master design, manage karigar assignments, and handle reassign confirmations.",
  "frontend/src/components/masterDesigns/MasterDesignImportDialog.tsx": "Dialog for importing master designs from files, parsing them, previewing results, and saving updates.",
  "frontend/src/components/masterDesigns/MasterDesignsTable.tsx": "Table displaying master designs with karigar names, status indicators, and edit/activate actions.",
  "frontend/src/components/orders/IngestionPreviewTable.tsx": "Displays a scrollable preview table of imported orders, marking unmapped design codes and showing order details with formatting helpers.",
  "frontend/src/components/orders/OrdersDataWarningBanner.tsx": "Shows a warning banner when invalid cached orders are detected, offering a button to clear cache and reload.",
  "frontend/src/components/orders/OrdersFiltersBar.tsx": "Provides search and filter controls for orders, including date ranges, karigar, status, and type filters with clear‑all support.",
  "frontend/src/components/orders/OrdersTable.tsx": "Renders the main orders table with optional row selection and design image viewing, formatting order attributes for display.",
  "frontend/src/components/orders/PartialFulfillmentDialog.tsx": "Dialog for entering partial supplied quantities for multiple RB orders with validation and confirmation.",
  "frontend/src/components/orders/RbSuppliedQtyEditDialog.tsx": "Dialog allowing users to edit an RB order’s total supplied quantity with validation and backend update mutation.",
  "frontend/src/components/status/BackendStatusIndicator.tsx": "UI component showing backend reachability with refresh, canister ID display, and collapsible error details.",
  "frontend/src/components/status/ConnectivityStatusBar.tsx": "Status bar that shows online/offline state and pending offline sync uploads with a manual sync button.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendReachability.ts": "Periodically runs health checks on the backend and exposes online/offline status, errors, and canister info.",
  "frontend/src/hooks/useCopyToClipboard.ts": "Clipboard helper hook providing copy status and a label function.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile with error classification and controlled retries.",
  "frontend/src/hooks/useEffectiveAppRole.ts": "Derives the user’s effective app role using profile data and admin backend checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useOrdersCache.ts": "Hydrates orders from IndexedDB, merges with backend data, sanitizes cached entries, and exposes loading/error states.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor API calls for fetching and mutating orders, master designs, karigars, and related data.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor with timeout, identity handling, optional admin initialization, and retry logic.",
  "frontend/src/index.css": "Global Tailwind CSS styles defining light/dark themes, layout constraints, and admin dashboard tab styling.",
  "frontend/src/lib/exports/karigarOrdersDownloads.ts": "Generates and triggers an HTML-based printable PDF view for a karigar’s orders with iOS-compatible handling.",
  "frontend/src/lib/exports/ordersExport.ts": "Filters orders by type, formats them, and exports the result as a downloadable CSV file.",
  "frontend/src/lib/karigars/normalizeKarigarName.ts": "Normalizes karigar names by trimming, collapsing spaces, and lowercasing for consistent comparison.",
  "frontend/src/lib/mapping/applyMasterDesignMapping.ts": "Applies master design mappings to orders, producing mapped/unmapped sets and a preview with resolved fields.",
  "frontend/src/lib/mapping/normalizeDesignCode.ts": "Normalizes design codes by trimming and collapsing whitespace for consistent matching.",
  "frontend/src/lib/orders/chunkOrders.ts": "Splits an orders array into batches of a specified size with input validation.",
  "frontend/src/lib/orders/deriveMetrics.ts": "Computes aggregate order metrics and per-karigar statistics using sanitized orders.",
  "frontend/src/lib/orders/formatKarigarName.ts": "Formats karigar names, returning 'Unassigned' when blank or whitespace.",
  "frontend/src/lib/orders/formatOptionalNumber.ts": "Formats optional numeric fields into fixed-decimal strings or empty strings when invalid.",
  "frontend/src/lib/orders/generateKarigarPOCode.ts": "Creates a deterministic PO code from a karigar name using the first three letters plus 01, defaulting to UNA01 for empty or unassigned names.",
  "frontend/src/lib/orders/getOrderTimestamp.ts": "Returns an order's timestamp as a Date, preferring uploadDate over createdAt and converting nanoseconds to milliseconds.",
  "frontend/src/lib/orders/isCustomerOrder.ts": "Checks whether an order type string contains 'co'.",
  "frontend/src/lib/orders/sortOrdersDesignWise.ts": "Sanitizes and sorts orders by normalized design code, then by order number.",
  "frontend/src/lib/orders/sortOrdersKarigarWise.ts": "Sanitizes and sorts orders by karigar name, then design code, then order number.",
  "frontend/src/lib/orders/validatePersistentOrder.ts": "Validates PersistentOrder fields and filters arrays to valid entries while counting skipped ones.",
  "frontend/src/lib/parsers/excel/extractImagesFromXlsx.ts": "Loads an XLSX file as a zip and extracts embedded images from xl/media, assigning them to rows in order.",
  "frontend/src/lib/parsers/excel/parseDesignImageMappingsFromWorkbook.ts": "Parses a worksheet with Sl no, Design code, and Image columns and maps embedded images to rows.",
  "frontend/src/lib/parsers/excel/parseMasterDesignsFromWorkbook.ts": "Parses master design entries from an Excel sheet using flexible column matching and normalized headers.",
  "frontend/src/lib/parsers/excel/parseOrdersFromWorkbook.ts": "Parses orders from an Excel sheet with flexible column matching, numeric validation, warnings, and error collection.",
  "frontend/src/lib/parsers/excel/readWorkbookFromFile.ts": "Ensures XLSX is loaded, reads an Excel file into a workbook, and validates sheet presence.",
  "frontend/src/lib/parsers/masterDesignParser.ts": "Dispatches master design parsing to PDF or Excel handlers and wraps errors with user-friendly messages.",
  "frontend/src/lib/parsers/orderParser.ts": "Routes PDF or Excel files to appropriate parsers and returns parsed orders with warnings and friendly errors.",
  "frontend/src/lib/parsers/pdf/extractText.ts": "Loads pdf.js from CDN and extracts structured text lines from each PDF page for downstream parsing.",
  "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts": "Parses master design entries from flattened PDF text lines by detecting headers and extracting design, generic name, and karigar mappings.",
  "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts": "Parses orders from PDF text using table-row or section-header formats, preserving karigar context and validating fields.",
  "frontend/src/lib/parsers/pdf/parseOrdersTableRowWithKarigar.ts": "Parses a single PDF table row into an order when format and tokens are valid, extracting numeric fields and karigar info.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/offline/db.ts": "Implements IndexedDB storage for orders, master designs, and queued ingestions with helpers for caching and queue management.",
  "frontend/src/offline/sync.ts": "Provides a hook to sync queued offline ingestions to the server with progress tracking and error handling.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Dashboard that loads orders, filters them by date and tab, computes metrics, and displays tables, summaries, and export options.",
  "frontend/src/pages/admin/DesignImagesPage.tsx": "Page for uploading, parsing, validating, and saving design image mappings from an Excel file.",
  "frontend/src/pages/admin/MasterDesignsPage.tsx": "Displays and filters master design entries with dialogs for adding, importing, and viewing karigar lists.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin interface for creating users, managing approvals, and blocking/unblocking user accounts.",
  "frontend/src/pages/karigar/KarigarDashboardPage.tsx": "Karigar dashboard that loads active orders, filters and sorts them, manages cache, and supports bulk delivery actions.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with branding, background, and a sign‑in button.",
  "frontend/src/pages/setup/BootstrapAdminPage.tsx": "One-time setup page that accepts a bootstrap token to initialize the first admin and reinitialize actors.",
  "frontend/src/pages/staff/IngestOrdersPage.tsx": "Handles uploading, parsing, mapping, previewing, and submitting order files with progress, error handling, and master design mapping.",
  "frontend/src/pages/staff/StaffDashboardPage.tsx": "Displays staff dashboards with multiple tabs and filterable order tables, deriving metrics and filtering by date, type, karigar, and status.",
  "frontend/src/pages/staff/UnmappedDesignCodesPage.tsx": "Shows unmapped design codes grouped by code with search and a dialog to add new master design mappings.",
  "frontend/src/pwa/clearPwaCaches.ts": "Clears Cache Storage and unregisters service workers to remove stale PWA assets.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker, checks for updates, auto-activates new versions, and reloads on controller change.",
  "frontend/src/utils/bootstrapErrorClassification.ts": "Classifies bootstrap errors into stopped-canister, network, or general errors and extracts diagnostic details.",
  "frontend/src/utils/errorPresentation.ts": "Converts raw errors into user-friendly messages using bootstrap error classification and decoding logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing) and storing, retrieving, or clearing them in sessionStorage.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it exceeds the specified duration.",
  "frontend/src/version.ts": "Exports a static build identifier string for version tracking.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins used by the frontend.",
  "project_state.json": "Contains project metadata, known UI issues, and existing feature-fix requirements for the KarigarFlow project."
}