{
  "kind": "build_request",
  "title": "Fix karigar validation error, improve admin tabs on mobile, and add vendor-portal design image import by design code",
  "projectName": "Malabar Partner",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the false error \"Karigar name '<name>' does not exist\" when editing a design mapping and selecting an existing karigar (example: selecting \"Raju Sanjay\" shows the error even though the karigar exists and has orders). Ensure karigar existence validation is case/whitespace-insensitive and matches the karigar list used in the UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when karigar name *Raju Sanjay* is selected while editing in design. Error karigar name doesn’t exists keeps showing, but however this karigar is already on list",
          "Karigar name 'RAJU SANJAY' does not exist. Please create the karigar first."
        ]
      },
      "acceptanceCriteria": [
        "In the Edit Design Mapping dialog, selecting an existing karigar (including names that differ only by casing or extra spaces, e.g., \"RAJU SANJAY\" vs \"Raju Sanjay\") does not show a \"does not exist\" error on save.",
        "Backend validations that check whether a karigar exists accept karigar names that match an existing stored karigar when compared using the same normalization as the frontend (trim + collapse spaces + case-insensitive).",
        "No regression: creating a new karigar still prevents true duplicates that only differ by casing/whitespace (e.g., cannot create both \"Raju Sanjay\" and \"RAJU   SANJAY\")."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the Admin Dashboard page, make the indicator tabs (Delivered / Hallmark / Total Orders / Customer Orders / Karigars) mobile-responsive so they do not overlap or look clumped on small screens. Also set the default selected tab to \"Total Orders\" whenever the Admin Dashboard is opened or refreshed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "on admin portal page, the indicators tabs looks clumpsy on mobile screen, overlapping each other. And make the tab *Total Orders* selected whenever app is opened or refreshed."
        ]
      },
      "acceptanceCriteria": [
        "On mobile widths (e.g., 360px), the admin tab triggers do not overlap; labels remain readable and tappable.",
        "Refreshing the Admin Dashboard or reopening the app lands on the \"Total Orders\" tab selected by default.",
        "Changing tabs still works as before and does not break the existing filtering/metrics behavior for each tab."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an option to retrieve/extract product images by design code from the vendor portal page https://mpn.malabargroup.com/VendorDesigns.aspx and use them as design images in the app, so admins can avoid relying on Excel embedded-image extraction or manually sharing URLs. Use the provided portal credentials for access (Username: V1000803, Password: 9884472485Si.).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "https://mpn.malabargroup.com/VendorDesigns.aspx",
          "If u can open this page, all product images as per design code is available if you can actually extract from that and add yourself in the design image it will be very helpful.",
          "Username: V1000803",
          "Password: 9884472485Si."
        ]
      },
      "acceptanceCriteria": [
        "Admin UI provides a clear workflow to fetch an image for a given design code from the vendor portal and save it as a design image mapping in the app (persisted and visible via existing Design Image viewer/mappings table).",
        "When a design code image is successfully fetched, the Design Image viewer can display it using the existing design-image retrieval flow.",
        "Failures (login blocked, design code not found, network errors) show an English, user-friendly error without exposing the vendor password in UI, logs, or toast messages.",
        "The system does not require admins to upload an Excel file to add images when the vendor fetch succeeds."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; create backend/migration.mo changes only if state schema upgrades are required.",
    "Do not modify files under frontend/src/components/ui (shadcn components); compose/wrap them instead.",
    "Do not edit immutable frontend paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Any handling of the vendor portal credentials must avoid exposing the password in client-visible code paths, UI rendering, or error messages."
  ],
  "nonGoals": [
    "Implement third-party authentication providers (only Internet Identity is supported).",
    "Add real-time updates (WebSockets/push notifications).",
    "Replace the entire Excel-based design image import flow; keep it working as-is alongside the new vendor-portal-based option."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}