{
  "kind": "build_request",
  "title": "Fix hallmark status update and staff portal orders loading",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support for bulk order status updates so that the Admin/Staff \"Mark as Hallmark\" action can update selected order lines to status \"given_to_hallmark\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "While selecting order line and clicking on *mark as hallmark* , it failed to update order status."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a shared method for bulk status updates (e.g., bulkUpdateOrderStatus(orderNos, newStatus)).",
        "Method updates the stored status for each existing orderNo in ordersMap.",
        "Method enforces authorization: only Admin or Staff callers can update order statuses; unauthorized callers are rejected with a clear error/trap.",
        "When called with newStatus = \"given_to_hallmark\" and valid orderNos, subsequent getOrders() returns those orders with status \"given_to_hallmark\".",
        "Frontend call path in frontend/src/hooks/useQueries.ts (useBulkUpdateOrderStatus) succeeds without throwing the \"Backend does not support bulk status updates yet\" error."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix backend authorization/approval logic so Staff users can fetch orders in the staff portal (getOrders) without being blocked by the approval gate immediately after profile creation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also on staff portal, order are still not fetched to view and update the status."
        ]
      },
      "acceptanceCriteria": [
        "A caller with an existing UserProfile.appRole = #Staff and the required authenticated permission can successfully call getOrders() even if they are not marked approved in the approval state.",
        "StaffDashboardPage no longer shows the \"Failed to load orders\" empty/error state when backend is online and orders exist, for a Staff user with a created profile.",
        "Karigar users remain subject to approval requirements (i.e., this change does not grant Karigar users access without approval)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure Admin and Staff portals reflect successful hallmark updates by refreshing orders and removing newly-updated \"given_to_hallmark\" orders from the \"Total Orders\" list after marking as hallmark.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "While selecting order line and clicking on *mark as hallmark* , it failed to update order status. Kindly check and rectify it."
        ]
      },
      "acceptanceCriteria": [
        "After successfully marking selected orders as hallmark, the UI no longer shows those orders in the \"Total Orders\" tab/list (because Total Orders excludes status \"given_to_hallmark\").",
        "After successfully marking selected orders as hallmark, the orders appear in the \"Hallmark\" tab/list.",
        "If the bulk update fails, the UI shows an error message (toast) and does not clear the selection."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing new third-party authentication methods beyond Internet Identity.",
    "Adding new order-status workflow states beyond what is required to fix \"given_to_hallmark\" updates and staff order fetching.",
    "Introducing external databases or off-chain storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}