{
  "kind": "build_request",
  "title": "Fix Master Design edit flow to use existing Karigar dropdown (changes not reflected in production)",
  "projectName": "Master Design Admin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Master Designs add/edit dialog, ensure the “Karigar Name” field is a dropdown (not a free-text input) that lists existing Karigars fetched from the backend so admins/staff can select an existing Karigar when editing a design mapping, instead of being prompted to add a new karigar name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Changes hasn’t been made as I had asked for"
        ]
      },
      "acceptanceCriteria": [
        "When editing an existing design mapping in Master Designs, the Karigar Name field renders as a dropdown populated with existing karigars returned by the backend.",
        "The user can change the selected karigar by selecting a different existing karigar from the dropdown and saving successfully.",
        "The edit flow does not require typing a new karigar name to change the mapping."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make the Karigar dropdown in the Master Design add/edit dialog resilient and user-friendly in edit flows by handling loading, error, and empty states explicitly (including a Retry action on error), and by warning the user if the design’s currently assigned karigar is not present in the fetched karigar list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Changes hasn’t been made as I had asked for"
        ]
      },
      "acceptanceCriteria": [
        "While karigars are loading, the dialog shows a clear loading state for the Karigar field and prevents saving until the list is available.",
        "If loading karigars fails, the dialog shows an error state and provides a Retry control that refetches karigars.",
        "If there are zero karigars, the dialog informs the user that no karigars are available and prevents saving until one exists.",
        "When editing a mapping whose existing karigar is not in the dropdown list, the dialog displays a warning telling the user to choose an existing karigar from the dropdown before saving."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts or other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Introducing external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}