{
  "kind": "build_request",
  "title": "Accept 'Karigar/Factory Name' column in Master Designs Excel import parser",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Master Designs Excel import parser to recognize the column header \"Karigar/Factory Name\" (and common punctuation/spacing variants that normalize to the same key) as the karigar/factory name column, so imported master design mappings populate `karigarName` instead of defaulting to \"Unassigned\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update your apps parser so it accepts the names"
        ]
      },
      "acceptanceCriteria": [
        "Given an Excel file where the karigar column header is exactly \"Karigar/Factory Name\", importing via the Master Designs import dialog parses rows with `entry.karigarName` set to the cell values (not \"Unassigned\" unless the cell is empty).",
        "Given an Excel file where the karigar column header is a common variant such as \"Karigar / Factory Name\" or \"Karigar-Factory Name\" (i.e., variants that normalize to the same normalized key), the parser still maps it to `karigarName`.",
        "No regression: existing supported headers such as \"Karigar Name\", \"Factory\", and \"Factory Name\" continue to be recognized.",
        "When the parsed preview is shown in the import dialog, the \"Karigar Name\" column displays the parsed values for affected files."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (these paths are immutable)."
  ],
  "nonGoals": [
    "Changing backend canister deployment behavior or reliability as part of this request.",
    "Adding new database/storage structures for karigar names.",
    "Redesigning the Master Designs page beyond what is necessary to reflect the corrected parsed values."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}