{
  "kind": "build_request",
  "title": "Fix admin portal crash on open (defensive rendering + error-proof dialogs)",
  "projectName": "KarigarFlow",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Identify and fix the runtime crash that occurs when opening the admin portal route (/admin), ensuring the page renders successfully even on a fresh load with no dialogs opened.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Fix this admin portal. It’s crashing with same error while opening. Please completely recheck totally without any flaw. It’s the last chance to make this app successful"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /admin no longer triggers a white screen or AppErrorBoundary for an admin user under normal conditions.",
        "The admin dashboard renders its header, metrics cards, and tabs without requiring any user interaction."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove all unsafe non-null assertions and/or unconditional rendering patterns that can crash the Admin Dashboard during initial render, especially where components receive props derived from nullable state (e.g., rbEditOrder). Ensure dialogs and dependent UI render safely when their backing state is null/empty and only mount when needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Fix this admin portal. It’s crashing with same error while opening."
        ]
      },
      "acceptanceCriteria": [
        "On initial load of AdminDashboardPage, no component receives a null value where it expects a non-null order object (e.g., eliminate patterns like passing rbEditOrder! when rbEditOrder is null).",
        "The RB supplied quantity edit dialog and any other admin dialogs do not throw if their backing state is null; they either do not render/mount or render a safe no-op state until opened with valid data.",
        "Admin dashboard remains stable when opening/closing dialogs repeatedly."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an explicit, user-friendly, non-crashing error state on the Admin Dashboard for unexpected data-shape issues (e.g., orders missing required fields) so that the portal stays usable and provides a clear recovery path (such as clearing local cache and retrying).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please completely recheck totally without any flaw."
        ]
      },
      "acceptanceCriteria": [
        "If corrupt/invalid orders exist (from backend or IndexedDB), the admin portal still loads and shows a non-blocking warning and/or inline error state rather than crashing.",
        "The existing 'clear local cache and reload' action remains available and works without throwing.",
        "Any displayed error text is in English and does not expose sensitive details."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable hook/bootstrapping files listed in SYSTEM_CONTEXT.frontend.immutablePaths; compose around them if changes are needed."
  ],
  "nonGoals": [
    "Adding new admin features unrelated to crash prevention (e.g., new exports, new tables, new roles).",
    "Changing authentication providers (Internet Identity remains the only auth).",
    "Backend schema redesign or migrations unless a frontend-only fix is proven impossible."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}