{
  "kind": "build_request",
  "title": "Fix authentication loop and UI visibility issues",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the authentication loop where after Internet Identity login, the app gets stuck on 'Loading your profile...' and redirects back to the login screen instead of reaching the dashboard. The authentication state should properly complete login, load the user profile, and navigate to the role-appropriate dashboard (admin/staff/karigar) without cycling between loading and logout states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "After login, the app gets stuck on 'Loading your profile...' and then redirects back to the login screen instead of showing the dashboard",
          "Issue1 Fix the login and authentication issue, where the page is stuck in login and not able to get to the app portal or dashboard page"
        ]
      },
      "acceptanceCriteria": [
        "After Internet Identity login, the authentication flow completes successfully",
        "User profile loads without errors",
        "App navigates to the appropriate dashboard (admin/staff/karigar) based on user role",
        "No cycling between loading and logout states",
        "No redirect back to login screen after successful authentication"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the UI visibility problem where all screens appear with black text on a beige/tan patterned background, making all content invisible and unreadable. Implement proper high-contrast color scheme with readable text colors, visible buttons, clear data displays, and appropriate backgrounds throughout the entire application so users can view data and access all app features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "All the screen in the app looks black with all texts black, can't see anything",
          "Issue2 All the screen in the app looks black with all texts black, can't see anything. Give proper coloring across the app so we can view the data easily and have access of our app"
        ]
      },
      "acceptanceCriteria": [
        "Text is clearly visible with high contrast against backgrounds",
        "Buttons and interactive elements are easily identifiable",
        "Data tables and cards display information with proper contrast",
        "Background colors do not interfere with text readability",
        "Color scheme is consistent across all pages (login, dashboard, orders, etc.)",
        "Status indicators and badges are clearly visible"
      ]
    }
  ],
  "constraints": [
    "Do not modify the backend (backend/main.mo)",
    "Do not change Internet Identity authentication hooks (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts)",
    "Do not modify immutable UI components (frontend/src/components/ui/)",
    "Preserve existing functionality from version 72 that worked correctly",
    "Keep the single-actor backend architecture unchanged"
  ],
  "nonGoals": [
    "Adding new features or functionality",
    "Changing the technology stack",
    "Modifying database schema or backend logic",
    "Redesigning the application layout or structure",
    "Adding new authentication methods"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}