{
  "kind": "build_request",
  "title": "Fix remaining UI overlap: sidebar, calendar popovers, and Master Designs dialogs/menus",
  "projectName": "KarigarFlow",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the global layout so the navigation/sidebar (including the mobile left Sheet menu) never overlaps or obscures page content across routes and viewport sizes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Sidebar still overlapping"
        ]
      },
      "acceptanceCriteria": [
        "On small screens and mobile Safari, opening/closing the left Sheet menu does not cause main content to visually overlap with the header, sidebar, or any overlay.",
        "Main content remains readable and clickable while the header stays sticky; no elements render underneath the header unexpectedly.",
        "No new horizontal scrollbars are introduced (overflow-x remains controlled)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the date-picker (calendar) popovers so they do not overlap surrounding UI or each other, and ensure only one calendar popover can remain open at a time in date filter UIs (e.g., From Date vs To Date).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Calendar still overlapping"
        ]
      },
      "acceptanceCriteria": [
        "In OrdersFiltersBar date filters, opening 'From Date' closes 'To Date' automatically and vice-versa (no two calendars open simultaneously).",
        "Calendar popover content is not clipped by parent containers and stays above tables/cards while open.",
        "After selecting a date, the corresponding popover closes and does not visually collide with other filter controls."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the Master Designs page overlap issues so that opening the Karigar List and any action menus/lists does not overlap or collide with the page layout (header/actions area, filter badge row, search row, card content, and table).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Master design page also when clicked on karigar list it’s overlapping, when clicking on action list it’s overlapping."
        ]
      },
      "acceptanceCriteria": [
        "On /admin/master-designs, opening 'Total Karigar List' renders a dialog that is fully visible within the viewport (scrolls internally if needed) and does not overlap awkwardly with underlying content.",
        "On narrow viewports, the Master Designs header title, buttons, filter badge row, and search input wrap/space correctly without overlapping each other.",
        "Any row-level 'Actions' UI (menus/dialogs triggered from the table) renders above the table and is not clipped by parent containers."
      ]
    }
  ],
  "constraints": [
    "Frontend-only fix: do not change backend canister interfaces or persistent state.",
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Keep the change set tightly scoped to resolving the reported overlap issues; avoid unrelated UI/feature changes.",
    "Minimize rebuild iterations and avoid unnecessary deployments to reduce additional credit usage."
  ],
  "nonGoals": [
    "Granting, refunding, or modifying user credits.",
    "Adding new features unrelated to overlap/layout behavior.",
    "Changing authentication behavior (Internet Identity) or app routing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing UI text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}