{
  "kind": "build_request",
  "title": "Fix karigar mapping display, mobile Safari zoom issues, and separate karigar tabs from total orders",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix karigar mapping not displaying correctly when viewing orders across all tabs (Today, Delivered, Hallmark, Total Orders, Customer Orders, and individual Karigar tabs). Ensure that when orders are filtered or displayed in any tab, the karigar name is correctly resolved and shown from the master design mappings.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Karigar mapping is not happening while display orders across tabs. Check front end n back end and solve this."
        ]
      },
      "acceptanceCriteria": [
        "Orders in all tabs display the correct karigar name from master design mappings",
        "Karigar resolution works consistently across Today, Delivered, Hallmark, Total Orders, Customer Orders, and individual Karigar tabs",
        "Empty or unassigned karigar fields display as 'Unassigned'",
        "Karigar names are correctly derived from design code mappings in the backend"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix mobile Safari rendering issues where the application displays at 50% zoom. Ensure the viewport is configured correctly so the entire application interface is visible on a single page without requiring zoom adjustments on mobile screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I'm using the app in safari iPhone and look how it's giving trouble, run diagnostics to resolve this completely. Same way the app is running on 50% zoom on mobile screens make sure it's completely visible in single page in the display when opened."
        ]
      },
      "acceptanceCriteria": [
        "Application renders at 100% zoom on Safari iPhone",
        "All UI elements are visible and properly sized on mobile screens",
        "No horizontal scrolling required on mobile devices",
        "Viewport meta tags are correctly configured for mobile display",
        "Touch interactions work smoothly without zoom interference"
      ]
    },
    {
      "id": "REQ-3",
      "text": "When updating or assigning a design code to a different karigar in the master designs management interface, automatically populate and display the karigar name that was already derived from the uploaded Excel file. The karigar dropdown or selection field should show all existing karigars including those imported from Excel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "All item design code and generic are matched with karigar name. When the karigar is already derived from the excel why it is not displaying while updating and assigning the design code to other karigar promptly."
        ]
      },
      "acceptanceCriteria": [
        "Karigar dropdown in master design edit dialog shows all karigars from both manual creation and Excel imports",
        "Pre-existing karigar assignments from Excel files are visible when editing a master design",
        "Updating a design code's karigar assignment immediately reflects the new mapping",
        "All karigars derived from Excel uploads are available for selection"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Remove individual karigar tab names from the Total Orders tab in the admin dashboard. Create a separate dedicated tab in the admin dashboard that displays all karigar-specific views and their orders, keeping the Total Orders tab clean and showing only aggregate order data without karigar-specific tabs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The karigar tab names shouldn't show in the total orders tab, it should classified separately in another tab in the admin dashboard"
        ]
      },
      "acceptanceCriteria": [
        "Total Orders tab no longer displays individual karigar sub-tabs",
        "A new dedicated tab exists in the admin dashboard for viewing orders by karigar",
        "The new karigar-focused tab shows all individual karigar tabs and their respective orders",
        "Navigation between Total Orders and the new Karigar Orders tab is intuitive",
        "Total Orders tab displays only aggregate data without karigar segmentation"
      ]
    }
  ],
  "constraints": [
    "Do not modify Internet Identity authentication hooks or components",
    "Preserve the single-actor Motoko backend architecture",
    "Do not edit read-only Shadcn UI component sources",
    "Maintain existing offline sync and caching functionality"
  ],
  "nonGoals": [
    "Adding new order status types",
    "Changing the Excel file format or parsing logic beyond fixing karigar display",
    "Modifying user role permissions or access control",
    "Adding new export formats beyond existing CSV/PDF/JPEG options"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}