{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Refresh and reflect hallmark bulk updates in Admin/Staff dashboards",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Ensure Admin and Staff dashboards correctly apply bulk hallmark status updates, refresh orders, and reflect moved orders across Total Orders and Hallmark tabs with proper error handling.",
      "acceptanceCriteria": [
        "After successfully marking selected orders as hallmark, the UI no longer shows those orders in the \"Total Orders\" tab/list (because Total Orders excludes status \"given_to_hallmark\").",
        "After successfully marking selected orders as hallmark, the orders appear in the \"Hallmark\" tab/list.",
        "If the bulk update fails, the UI shows an error message (toast) and does not clear the selection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix useBulkUpdateOrderStatus to call the backend bulk update capability using the correct argument shape (BulkOrderUpdate object) and keep the existing post-mutation orders query invalidation/refetch so dashboards refresh and reflect status changes."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the Admin \"Mark as Hallmark\" action flow to rely on the corrected bulk update hook so that on success orders refresh and naturally move from the Total Orders list (status != given_to_hallmark) into the Hallmark tab; ensure failure shows a toast and keeps the current selection intact."
        },
        {
          "path": "frontend/src/pages/staff/StaffDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the Staff \"Mark as Hallmark\" action flow to rely on the corrected bulk update hook so that on success orders refresh and move from Total Orders into Hallmark; ensure failure shows a toast and keeps the current selection intact."
        }
      ]
    }
  ]
}