{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PDF Daily Orders parsing with karigar-section assignment preserved in ingestion preview",
  "requirements": [
    {
      "id": "REQ-65",
      "summary": "Implement PDF order parsing for Daily Orders with karigar/factory section tracking so each parsed order inherits the most recently encountered karigar/factory name until the next header appears.",
      "acceptanceCriteria": [
        "Uploading a PDF on the Staff/Admin “Ingest Orders” page no longer throws the current \"PDF parsing is not yet implemented\" error.",
        "The PDF parser extracts orders and sets each parsed order’s `karigarName` to the most recently encountered karigar/factory name found earlier in the PDF text (until a new karigar/factory name is encountered).",
        "If a PDF contains multiple karigar/factory sections, orders are correctly grouped/assigned per section (no leakage across sections).",
        "If the parser cannot find any karigar/factory name in the PDF, it still parses orders but sets `karigarName` to an empty string (not \"Unassigned\") and the UI treats them as unmapped/unassigned in the existing unmapped workflow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/parsers/pdf/extractText.ts",
          "operation": "modify",
          "description": "Improve PDF text extraction fidelity for tabular parsing by preserving reading order and line breaks (e.g., grouping text items into rows) so downstream PDF order parsing can reliably detect karigar/factory headers and order rows."
        },
        {
          "path": "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts",
          "operation": "modify",
          "description": "Replace the current stub with a real Daily Orders PDF parser that (1) scans the extracted per-page text row-by-row, (2) detects karigar/factory header lines and updates `currentKarigarName`, (3) parses subsequent order rows into `Order` objects inheriting `karigarName = currentKarigarName`, and (4) falls back to `karigarName: ''` when no header is ever detected. Ensure createdAt/uploadDate/status/isCustomerOrder are set consistently with the Excel parser."
        },
        {
          "path": "frontend/src/lib/parsers/orderParser.ts",
          "operation": "modify",
          "description": "Keep the PDF parsing path intact but adjust error messaging/handling if needed so PDF uploads no longer fail with the previous \"not yet implemented\" error and instead surface actionable parse failures when the PDF format is unsupported."
        }
      ]
    },
    {
      "id": "REQ-66",
      "summary": "Update ingestion preview/mapping flow so PDF-derived `karigarName` is preserved and visible while still supporting master-design mapping for `genericName` and unmapped design-code detection.",
      "acceptanceCriteria": [
        "After selecting a PDF, the ingestion preview tables show the PDF-derived `karigarName` values for the parsed orders.",
        "The existing master-design mapping step still fills `genericName` where a design-code mapping exists, and continues to classify unmapped design codes into the existing “Unmapped Orders” preview section.",
        "The ingestion preview does not overwrite non-empty `karigarName` values produced by the PDF parser with a fallback label like \"Unassigned\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/mapping/applyMasterDesignMapping.ts",
          "operation": "modify",
          "description": "Preserve PDF-derived karigar assignment during master-design mapping: when a design-code match exists, always fill `genericName` from the master design, but only fill/overwrite `karigarName` from the master design when the incoming order’s `karigarName` is empty."
        },
        {
          "path": "frontend/src/components/orders/IngestionPreviewTable.tsx",
          "operation": "modify",
          "description": "Adjust the preview table rendering so `karigarName` remains visible even when the design code is unmapped (do not replace the Karigar cell with an \"Unmapped\" label). Keep unmapped detection for design/generic columns and continue highlighting unmapped design codes."
        },
        {
          "path": "frontend/src/pages/staff/IngestOrdersPage.tsx",
          "operation": "modify",
          "description": "Ensure the ingestion preview/mapping flow continues to pass through parsed `karigarName` values from PDF parsing into the preview tables and that no UI-level fallback overwrites non-empty `karigarName` during parse/mapping state updates."
        }
      ]
    }
  ]
}