{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "KarigarFlow: Resolve remaining overlap issues (mobile Sheet nav, calendar popovers, Master Designs dialogs/menus)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Adjust global AppShell layout and mobile Sheet navigation layering/scroll behavior so it never obscures or overlaps routed content across viewport sizes.",
      "acceptanceCriteria": [
        "On small screens and mobile Safari, opening/closing the left Sheet menu does not cause main content to visually overlap with the header, sidebar, or any overlay.",
        "Main content remains readable and clickable while the header stays sticky; no elements render underneath the header unexpectedly.",
        "No new horizontal scrollbars are introduced (overflow-x remains controlled)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Tighten the global flex layout to prevent overlap: ensure header/main/footer flex children use min-w-0 where needed, and refine the mobile SheetContent sizing/scroll strategy (e.g., viewport-bounded height with internal scrolling) so the left menu cannot visually collide with the sticky header or main content on iOS Safari."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global overflow + stacking rules to ensure consistent overlay layering without content slipping under the sticky header; keep overflow-x constrained while avoiding any new horizontal scrollbars. Retain and refine the existing Radix overlay z-index rules as needed to support the Sheet menu across routes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make OrdersFiltersBar date picker popovers mutually exclusive, unclipped, and self-closing on selection to prevent calendar overlap/collisions.",
      "acceptanceCriteria": [
        "In OrdersFiltersBar date filters, opening 'From Date' closes 'To Date' automatically and vice-versa (no two calendars open simultaneously).",
        "Calendar popover content is not clipped by parent containers and stays above tables/cards while open.",
        "After selecting a date, the corresponding popover closes and does not visually collide with other filter controls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/orders/OrdersFiltersBar.tsx",
          "operation": "modify",
          "description": "Update the controlled Popover open-state logic so opening one calendar explicitly closes the other (e.g., custom onOpenChange handlers per popover), and ensure each popover closes on date selection. Also adjust PopoverContent positioning/collision handling (side/align/offset) to reduce collisions with adjacent controls without editing shadcn ui components."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure popover overlays remain above surrounding UI and are not clipped by common parent containers used by filter bars/tables; leverage the existing global Radix popper/z-index rules and extend only if required to prevent calendar clipping/overlap."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix /admin/master-designs responsive layout and overlay rendering so Karigar List dialog and any table-triggered actions render within viewport and above content without clipping.",
      "acceptanceCriteria": [
        "On /admin/master-designs, opening 'Total Karigar List' renders a dialog that is fully visible within the viewport (scrolls internally if needed) and does not overlap awkwardly with underlying content.",
        "On narrow viewports, the Master Designs header title, buttons, filter badge row, and search input wrap/space correctly without overlapping each other.",
        "Any row-level 'Actions' UI (menus/dialogs triggered from the table) renders above the table and is not clipped by parent containers."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/MasterDesignsPage.tsx",
          "operation": "modify",
          "description": "Refine Master Designs header and control layout for narrow viewports: enforce consistent wrapping and spacing for title/actions/badge/search rows (min-w-0, break/wrap behavior, and container overflow visibility) so controls never overlap each other."
        },
        {
          "path": "frontend/src/components/karigar/TotalKarigarListDialog.tsx",
          "operation": "modify",
          "description": "Make the 'Total Karigar List' dialog viewport-safe on mobile: constrain width/height using viewport units and ensure the dialog content scrolls internally without being cut off; keep the dialog fully visible and usable on small screens."
        },
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignsTable.tsx",
          "operation": "modify",
          "description": "Adjust the table wrapper/container overflow behavior to prevent clipping of any table-triggered overlay UI (menus/dialogs) while retaining horizontal scrolling for the table; ensure overlays render above the table region instead of being cut off by overflow settings."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed after layout adjustments, further tune global Radix overlay and popper stacking/clipping safeguards to ensure dialogs/menus used on Master Designs render above cards/tables and are not clipped by overflow containers."
        }
      ]
    }
  ]
}