{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin/Staff delivered controls removal, Admin Delivered bulk hallmark action, and Admin dashboard tab/card color styling",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Remove/disable any Staff/Admin UI that can mark orders as delivered so only Karigar portal can perform delivered updates.",
      "acceptanceCriteria": [
        "Admin dashboard pages do not present a button/action that triggers a status change to \"delivered\".",
        "Staff dashboard pages do not present a button/action that triggers a status change to \"delivered\".",
        "If any legacy Staff/Admin control remains visible for workflow reasons, it must be disabled and show a clear, English explanation that only Karigar can mark delivered (no backend call attempted)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/staff/StaffDashboardPage.tsx",
          "operation": "modify",
          "description": "Remove the Staff \"Mark as Delivered\" bulk action and related selection-driven delivered workflow (including disabling/removing any dialog wiring that would trigger delivered status updates) so Staff cannot initiate delivered status changes from the UI."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Confirm Admin UI has no delivered status-changing controls; ensure no delivered action buttons are introduced in any Admin tab while implementing other requested changes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add bulk selection + \"Give to Hallmark\" action to Admin Delivered tab using the existing bulk status update flow.",
      "acceptanceCriteria": [
        "Delivered tab supports selecting one or more rows (checkbox selection) similar to the Total Orders tab selection UI.",
        "Delivered tab includes an action button that sets the selected delivered orders’ status to \"given_to_hallmark\" using the existing bulk status update flow.",
        "After a successful update, the selected orders are no longer shown in the Delivered tab list and appear under the Hallmark tab (because of existing tab filtering by status).",
        "A success toast is shown indicating how many orders were updated; failures show an error toast message in English.",
        "The existing Delivered tab filters (karigar/status/date/orderNo/CO/RB filters) continue to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Implement Delivered-tab row selection (checkboxes) by enabling OrdersTable selectionMode for the Delivered tab and maintaining a Delivered-specific selected set; add a Delivered-tab bulk action button to set selected orders to \"given_to_hallmark\" via the existing useBulkUpdateOrderStatus mutation, with success/error toasts and selection reset on completion."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add distinct accent colors to Admin dashboard metric cards and a colored active-tab indicator/slider styling for Admin dashboard tabs.",
      "acceptanceCriteria": [
        "Each of the four Admin dashboard metric cards has a distinct, consistent accent color (e.g., title/accent bar/badge/background tint) while preserving readability and existing layout.",
        "The Admin dashboard TabsList/TabsTrigger styling clearly shows the active tab with a colored indicator/underline/slider bar, and inactive tabs have a visually distinct state.",
        "No edits are made to immutable Shadcn UI component source files; styling is applied via page-level className overrides and/or global Tailwind styles in allowed files.",
        "All user-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Apply page-level Tailwind className styling to the four metric cards (Orders in View, Customer Orders, Active Karigars, Total Weight) to give each a distinct accent (e.g., border/top accent + subtle background tint), and add TabsList/TabsTrigger className overrides to show a colored active indicator/underline and clear inactive states without modifying shadcn/ui component source."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal global Tailwind/CSS helpers (within existing layers) to support Admin dashboard tab indicator/slider styling and/or reusable metric-card accent styles if needed, ensuring readability in light/dark modes."
        }
      ]
    }
  ]
}