{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Malabar Partner — Frontend rollback hardening to Version 54 + build identifier + cache-safe SW updates",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the frontend code and build output are explicitly pinned to the Version 54 snapshot and self-identify as v54 to avoid accidental v55/56 rebuilds.",
      "acceptanceCriteria": [
        "A new draft build is created from the Version 54 code snapshot (no Version 55/56 changes present).",
        "Production deployment is updated so runtime behavior and UI match the Version 54 deployment exactly.",
        "No automated step in the build process silently rebuilds from Version 55/56 after selecting Version 54."
      ],
      "file_operations": [
        {
          "path": "frontend/src/version.ts",
          "operation": "create",
          "description": "Add a single source of truth build identifier constant (e.g., export const BUILD_ID = 'v54') to be used across UI + PWA/service-worker cache naming so the deployed build clearly and consistently matches Version 54."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Log the BUILD_ID on app bootstrap (developer-verifiable in console) and ensure any build identifier wiring is initialized early so build snapshot mismatches are immediately visible during QA."
        },
        {
          "path": "frontend/public/service-worker.js",
          "operation": "modify",
          "description": "Align service worker cache naming/versioning with the Version 54 build identifier (via a v54 cache name) to prevent v55/56 asset caches from being reused after rollback; keep the cache name change tightly coupled to the build identifier to avoid accidental drift."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display a user-visible build identifier (v54) in an existing global UI surface so the team can confirm the deployed version.",
      "acceptanceCriteria": [
        "Frontend displays the current app version/build identifier in an existing global UI surface (e.g., AppShell footer/status area) without requiring special permissions.",
        "Backend exposes a query method (or extends an existing health/status method) returning the app version/build identifier.",
        "The displayed/reported version is 'v54' after the rollback deployment is complete."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Show the BUILD_ID (v54) in the existing AppShell footer (global UI surface) in English so any user can verify what version is deployed without special permissions."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Import BUILD_ID and include it in a startup console log line so developers can verify the running build quickly in production."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Prevent stale v55/56 assets and draft/caching issues from blocking a clean rollback to Version 54 by improving service worker update + cache clearing behavior.",
      "acceptanceCriteria": [
        "After rollback deployment, a hard refresh is not required to see Version 54 UI/assets; the app updates cleanly for users already on the site.",
        "Service worker cache versioning is updated/handled so stale cached assets from Version 55/56 are not served after rollback.",
        "Rollback/rebuild does not get forced into rebuilding Version 55 due to draft-expiry handling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pwa/clearPwaCaches.ts",
          "operation": "create",
          "description": "Add a small utility to clear browser Cache Storage entries and unregister service workers on demand (best-effort) so the app can proactively remove stale v55/56 caches after rollback."
        },
        {
          "path": "frontend/public/service-worker.js",
          "operation": "modify",
          "description": "Implement an update flow that avoids serving stale assets after rollback: add a message handler (e.g., SKIP_WAITING), ensure activate removes non-current caches, and adjust fetch strategy for JS/CSS/static assets to prefer fresh network responses with cache fallback to minimize v55/56 asset persistence."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "modify",
          "description": "Enhance registration to actively adopt updated service workers without requiring a hard refresh: when an update is installed and waiting, postMessage to trigger skipWaiting and, upon controllerchange, reload the page once to swap to the new v54-controlled assets."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Wire service worker registration at startup by calling registerServiceWorker() so the improved cache/update behavior actually takes effect in production."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "On logout, in addition to clearing React Query cache, invoke clearPwaCaches (and any existing local caches) to prevent users from remaining stuck on stale cached assets after a rollback."
        },
        {
          "path": "frontend/src/components/errors/AppErrorBoundary.tsx",
          "operation": "modify",
          "description": "Extend the existing 'Logout & Clear Session' recovery action to also invoke clearPwaCaches before reloading, ensuring a broken/stale cached build can be recovered without manual hard refresh steps."
        }
      ]
    }
  ]
}