{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix authentication loop and UI visibility issues",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix authentication loop preventing users from reaching dashboard after Internet Identity login",
      "acceptanceCriteria": [
        "After Internet Identity login, the authentication flow completes successfully",
        "User profile loads without errors",
        "App navigates to the appropriate dashboard (admin/staff/karigar) based on user role",
        "No cycling between loading and logout states",
        "No redirect back to login screen after successful authentication"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Fix the sequential authentication checks (identity → actor → profile → role) to prevent cycling between loading and logout states. Ensure that after successful Internet Identity login, the app properly waits for actor initialization, profile loading, and role resolution before navigating to the dashboard. Review the loading state logic to eliminate premature redirects back to the login screen. Do not modify authentication hooks as per constraints."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Fix the authentication flow handling to ensure proper completion after Internet Identity login. Review the redirect logic that currently causes the app to get stuck on 'Loading your profile...' and then redirect back to login instead of reaching the dashboard. Ensure role-appropriate navigation (admin/staff/karigar) occurs only after identity, actor, profile, and role are fully resolved."
        },
        {
          "path": "frontend/src/hooks/useEffectiveAppRole.ts",
          "operation": "modify",
          "description": "Review and fix the effective role derivation logic to ensure it properly combines user profile role with backend admin check without causing infinite loops or premature failures. Ensure the hook completes successfully and returns a stable role value that allows navigation to proceed."
        },
        {
          "path": "frontend/src/hooks/useCurrentUser.ts",
          "operation": "modify",
          "description": "Review and fix the current user profile fetching logic to ensure it properly handles the actor dependency, avoids infinite retry loops, and returns a stable profile result. Ensure error classification does not cause the app to cycle between loading and logout states."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix UI visibility with black text on beige patterned background making all content unreadable",
      "acceptanceCriteria": [
        "Text is clearly visible with high contrast against backgrounds",
        "Buttons and interactive elements are easily identifiable",
        "Data tables and cards display information with proper contrast",
        "Background colors do not interfere with text readability",
        "Color scheme is consistent across all pages (login, dashboard, orders, etc.)",
        "Status indicators and badges are clearly visible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Fix the global color scheme to ensure high-contrast, readable text throughout the application. Replace any black-on-beige or low-contrast color combinations with proper foreground and background colors. Ensure CSS variables for backgrounds, foregrounds, borders, and text colors provide sufficient contrast for readability. Remove or override any styling that causes black text on tan/beige patterned backgrounds."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Review and fix the Tailwind configuration to ensure the custom color palette provides high-contrast combinations. Update CSS variable mappings to ensure text colors are clearly distinguishable from backgrounds across all application screens. Ensure the extended color scheme does not interfere with text readability."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Fix the login page styling to ensure the diamond icon, 'KarigarFlow' title, subtitle text, and logout button are clearly visible with proper contrast against the background. Remove any black-on-beige or patterned background that makes content invisible."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Fix the admin dashboard page styling to ensure all tabs, filters, order tables, buttons, and data displays are clearly visible with high contrast. Ensure status indicators and badges are easily identifiable. Remove any styling that causes black text on beige backgrounds or makes interactive elements invisible."
        },
        {
          "path": "frontend/src/pages/staff/StaffDashboardPage.tsx",
          "operation": "modify",
          "description": "Fix the staff dashboard page styling to ensure all tabs, filters, order tables, buttons, metrics cards, and data displays are clearly visible with high contrast. Ensure the color scheme is consistent with the rest of the application and all elements are readable."
        },
        {
          "path": "frontend/src/pages/karigar/KarigarDashboardPage.tsx",
          "operation": "modify",
          "description": "Fix the karigar dashboard page styling to ensure all tabs, metrics cards, order tables, and buttons are clearly visible with high contrast. Ensure all text and interactive elements are easily identifiable against the background."
        },
        {
          "path": "frontend/src/components/orders/OrdersTable.tsx",
          "operation": "modify",
          "description": "Fix the orders table styling to ensure all columns, rows, status-based coloring, and text are clearly visible with proper contrast. Ensure data is readable and status indicators are distinguishable. Remove any styling that makes table content invisible or unreadable."
        },
        {
          "path": "frontend/src/components/admin/MetricsChart.tsx",
          "operation": "modify",
          "description": "Fix the metrics chart/cards styling to ensure all metric values, labels, icons, and color-coded elements are clearly visible with high contrast. Ensure the dashboard grid displays information with proper readability."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Fix the app shell layout styling to ensure the header, navigation tabs (Admin, Staff, Karigar), mobile menu, and user controls are clearly visible with proper contrast. Ensure all interactive elements are easily identifiable across all pages."
        },
        {
          "path": "frontend/src/components/orders/OrdersFiltersBar.tsx",
          "operation": "modify",
          "description": "Fix the filters bar styling to ensure search inputs, date range pickers, dropdown selects, toggle buttons, and clear filters option are clearly visible and readable with proper contrast."
        },
        {
          "path": "frontend/src/lib/orders/getStatusRowColor.ts",
          "operation": "modify",
          "description": "Review and fix the status row color mapping to ensure all status-based background colors provide sufficient contrast for text readability. Ensure status indicators (pending, delivered, hallmark, billed) are clearly visible and distinguishable."
        },
        {
          "path": "frontend/src/components/admin/KarigarSummaryCards.tsx",
          "operation": "modify",
          "description": "Fix the karigar summary cards styling to ensure all order counts, quantities, karigar names, and color-coded elements are clearly visible with proper contrast. Ensure cards display information readably."
        }
      ]
    }
  ]
}