{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Karigar dropdown completeness and legacy-safe editing in Master Design Mapping dialog",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show the full Karigar list (including names present in saved master designs) in the Karigar dropdown for both Add and Edit Design Mapping dialogs.",
      "acceptanceCriteria": [
        "After importing/mapping master designs from Excel, opening Edit Design Mapping shows a dropdown containing all unique karigar names present in saved master designs (including the expected 19 names).",
        "The dropdown list is consistent between “Add Design Mapping” and “Edit Design Mapping” dialogs.",
        "The list is not limited to only manually-created karigars; it includes karigar names coming from existing master design mappings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extend the karigar aggregation used by useListKarigars() to also merge in distinct karigarName values from the already-saved master designs (fetched via existing backend capabilities), deduplicate, filter empty/whitespace-only, and keep alphabetical sorting. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useSaveMasterDesigns() success handling to also invalidate/refetch the ['karigars'] query so the dropdown updates immediately after master design imports/edits. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx",
          "operation": "modify",
          "description": "Ensure the dialog uses the aggregated karigar list from useListKarigars() consistently for both Add Mapping and Edit Design Mapping (no separate/partial sources). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Stop incorrectly blocking save in Edit Design Mapping when the current karigar exists in the available list; ensure selected value resolves correctly and unchanged saves work.",
      "acceptanceCriteria": [
        "If the currently assigned karigar name matches one of the karigar names available from the backend (including those derived from master designs), the warning is not shown and the Save button is enabled (subject to other normal validation).",
        "The dropdown’s selected value correctly resolves to the current karigar when editing an existing design mapping.",
        "Saving an unchanged mapping (code/generic/karigar unchanged) succeeds without requiring re-selection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx",
          "operation": "modify",
          "description": "Normalize karigar name comparisons when determining whether the original/selected karigar exists in the fetched list (e.g., trim and collapse whitespace for comparisons) and, on edit-open, resolve the initial Select value to the matching option from the list when a normalized match exists. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx",
          "operation": "modify",
          "description": "Adjust Save-button disabling logic so it only blocks when truly invalid (missing required fields/loading/error), not when the current karigar is actually present in the aggregated list. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Provide a legacy/unknown karigar fallback option in Edit Design Mapping when the current karigar is not in the standard list, while allowing save without forcing changes.",
      "acceptanceCriteria": [
        "When editing a design mapping whose current karigar name is not present in the fetched karigar list, the dropdown includes an extra option for that exact name so the current value can remain selected.",
        "The UI continues to display a warning that the current karigar is not in the standard list, but Save is not blocked if the legacy option remains selected and all other required fields are valid.",
        "Switching from the legacy option to a known karigar works and saving performs the existing reassignment behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx",
          "operation": "modify",
          "description": "When editing and the original karigar is not found in the fetched karigar options, inject an additional Select option for the exact original value labeled as legacy/unknown (English text), keep it selected by default, and update the warning copy to indicate it is not in the standard list while not blocking Save. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx",
          "operation": "modify",
          "description": "Update validation so Save is allowed when the legacy/unknown option remains selected (and other required fields are valid), while still allowing users to switch to a known karigar and save with existing reassignment messaging/behavior. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}