{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Master Designs: enforce Karigar dropdown + resilient edit flow states",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Master Design add/edit dialog uses a backend-fetched Karigar dropdown (no free-text) for selecting an existing karigar during edits.",
      "acceptanceCriteria": [
        "When editing an existing design mapping in Master Designs, the Karigar Name field renders as a dropdown populated with existing karigars returned by the backend.",
        "The user can change the selected karigar by selecting a different existing karigar from the dropdown and saving successfully.",
        "The edit flow does not require typing a new karigar name to change the mapping."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx",
          "operation": "modify",
          "description": "Audit and enforce that the Karigar Name control is always the existing Select-based dropdown driven by the fetched karigar list (no fallback to free-text), including ensuring edit-mode prefill uses a dropdown value and save submits the selected dropdown value only."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden the karigar list query used by the dialog (useListKarigars) to consistently fetch and return the current backend karigar list for dropdown population (ensure stable caching/refresh behavior suitable for edit dialogs)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add explicit loading/error/empty states (with Retry) for the Karigar dropdown and block saving until valid; warn and require user action if the currently assigned karigar is missing from the fetched list.",
      "acceptanceCriteria": [
        "While karigars are loading, the dialog shows a clear loading state for the Karigar field and prevents saving until the list is available.",
        "If loading karigars fails, the dialog shows an error state and provides a Retry control that refetches karigars.",
        "If there are zero karigars, the dialog informs the user that no karigars are available and prevents saving until one exists.",
        "When editing a mapping whose existing karigar is not in the dropdown list, the dialog displays a warning telling the user to choose an existing karigar from the dropdown before saving."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx",
          "operation": "modify",
          "description": "Ensure the dialog explicitly renders loading, error (with Retry), and empty states for the Karigar field; disable Save while these states are present; and when editing with an original karigar not present in the fetched list, show a warning and additionally disable Save until the user selects a valid karigar from the dropdown (i.e., a value present in the fetched list)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust useListKarigars query options to support the dialog’s resilience requirements (e.g., predictable retry behavior, enabling manual refetch via Retry, and ensuring loading/error states propagate cleanly to the UI)."
        }
      ]
    }
  ]
}