{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Karigar directory + selection for Master Design assignments (frontend)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add an “Add Karigar” action on Master Designs page to create a saved Karigar name via dialog.",
      "acceptanceCriteria": [
        "Master Designs page shows a new button near “Add Mapping” to open an “Add Karigar” dialog.",
        "The dialog allows entering a Karigar name and saving it; on success it shows a success toast and closes.",
        "The Karigar list is refreshed after adding so it is immediately available for selection in the edit mapping flow.",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/karigar/AddKarigarDialog.tsx",
          "operation": "create",
          "description": "Create an Add Karigar dialog component (name input + Save/Cancel) that uses the React Query mutation hook to add a Karigar, disables Save while pending, and shows success/error toasts. Use the shadcn-ui component library (Dialog, Button, Input/Label) for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/MasterDesignsPage.tsx",
          "operation": "modify",
          "description": "Add a top-level “Add Karigar” button near the existing “Add Mapping” button, wire state to open/close AddKarigarDialog, and ensure the dialog is mounted so successful add closes and the karigar list can refresh for downstream selection. Use shadcn-ui Button styling for parity with existing actions; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Replace free-text Karigar Name input in Master Design add/edit dialog with a selectable list sourced from saved Karigars.",
      "acceptanceCriteria": [
        "When adding or editing a master design mapping, the Karigar field is a selectable list populated from the saved Karigar names.",
        "Saving the form persists the selected Karigar name into the MasterDesignEntry.karigarName value.",
        "Editing an existing mapping pre-selects the currently saved karigarName (or shows an empty/unselected state if it does not exist in the saved list).",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/masterDesigns/MasterDesignFormDialog.tsx",
          "operation": "modify",
          "description": "Replace the karigarName text input with a selection control bound to the saved Karigar list (fetched via a React Query hook). Ensure edit mode pre-selects the existing mapping karigarName when present; otherwise show an empty/unselected state. On save, persist the selected value into MasterDesignEntry.karigarName, keep Save disabled while the master design save mutation is pending, and handle loading/error states for the karigar list (e.g., disable selection and show an inline message/toast). Use shadcn-ui form primitives where available for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add React Query hooks to fetch and add Karigars and integrate them into Master Designs UI with proper loading/error handling.",
      "acceptanceCriteria": [
        "A query hook exists to fetch the Karigar list and cache it with React Query.",
        "A mutation hook exists to add a Karigar and invalidates/refetches the Karigar list on success.",
        "Master Designs UI uses these hooks and handles loading/error states (e.g., disable save while pending, show toast/error state on failure)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for Karigar list management: a list query hook that calls the backend actor’s listKarigars() and a create mutation hook that calls createKarigar(...), with invalidation/refetch of the karigar list query on success. Ensure hooks respect actor availability (useActor) and are safe under auth/authorization failures returned by the backend (surface errors for UI to present)."
        },
        {
          "path": "frontend/src/pages/admin/MasterDesignsPage.tsx",
          "operation": "modify",
          "description": "Wire Master Designs page and its dialogs to use the new Karigar hooks (directly or via child components) so the list is available for the mapping dialog selection and is refreshed after Add Karigar succeeds (via query invalidation). Verify RoleGate / authorization behavior remains consistent with existing admin/staff access patterns from the authorization component; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}