{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-15T14:57:59.667Z",
  "summary": "REQ-65 and REQ-66 appear implemented on the frontend via new PDF text extraction and PDF order parsing with karigar/factory section tracking, plus mapping logic that preserves non-empty PDF-derived karigarName through the ingestion preview. The backend change required by REQ-67 cannot be verified from the truncated backend diff. The diff summary also indicates many unrelated frontend/auth/connectivity/error-handling UI changes not requested in this BuildRequest.",
  "missing_requirements": [
    {
      "id": "REQ-67",
      "requirement": "Update backend order upload mapping behavior so that when uploadParsedOrders receives an order with a non-empty karigarName, the backend does not overwrite that karigar assignment with the master-design karigarName; it should still use master designs to fill genericName when available and keep the order mapped/active behavior consistent.",
      "reason": "The only backend file shown (backend/main.mo) is truncated and does not include the uploadParsedOrders implementation or any evidence of the specified conditional overwrite behavior, design-code normalization for lookup during upload, or confirmation that authorization behavior is unchanged.",
      "evidence": [
        "backend/main.mo (truncated in diff; uploadParsedOrders logic not visible)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added dynamic PDF.js loading from a CDN for PDF text extraction (pdfjs-dist via cdnjs).",
      "reason": "REQ-65 asks to implement PDF parsing behavior, but does not request introducing a CDN-loaded third-party library/runtime dependency. This is an implementation addition beyond the stated requirements.",
      "evidence": [
        "frontend/src/lib/parsers/pdf/extractText.ts"
      ]
    },
    {
      "description": "Implemented parsing of master designs from PDF text (parseMasterDesignsFromPdfText).",
      "reason": "BuildRequest focuses on Daily Orders PDF parsing and ingestion flow; it does not request adding/altering Master Design PDF parsing.",
      "evidence": [
        "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts"
      ]
    },
    {
      "description": "Large set of unrelated frontend changes: bootstrap error watchdog/retry logic, safe actor migration, profile setup modal changes, access denied screen, role gate, connectivity status bar, extensive error boundary enhancements, and multiple dashboard/page updates unrelated to PDF karigar-section assignment.",
      "reason": "These changes are not requested by REQ-65/66/67 and constitute additional features/refactors outside the stated scope and non-goals (\"Do not redesign unrelated dashboards/exports beyond what is necessary\").",
      "evidence": [
        "frontend-file-summaries.txt"
      ]
    }
  ],
  "confidence": 0.66,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/orders/IngestionPreviewTable.tsx",
    "frontend/src/lib/mapping/applyMasterDesignMapping.ts",
    "frontend/src/lib/parsers/orderParser.ts",
    "frontend/src/lib/parsers/pdf/extractText.ts",
    "frontend/src/lib/parsers/pdf/parseMasterDesignsFromPdfText.ts",
    "frontend/src/lib/parsers/pdf/parseOrdersFromPdfText.ts",
    "frontend/src/pages/staff/IngestOrdersPage.tsx",
    "project_state.json"
  ]
}